#language: ru

@tree
@БыстрыеПроверки

Функционал: Открытие всех отчётов и обработок

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПравДоступа"

	Дано Я открываю основную форму отчета "АнализПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПравДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПраваДоступа"

	Дано Я открываю основную форму отчета "ПраваДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПраваДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОбновленияОбластейДанных"

	Дано Я открываю основную форму отчета "ПрогрессОбновленияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОбновленияОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыПроверкиУчета"

	Дано Я открываю основную форму отчета "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыПроверкиУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_ОтчетОтладкаЗагрузки"

	Дано Я открываю основную форму отчета "ТСМ_RMQ_ОтчетОтладкаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_RMQ_ОтчетОтладкаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_АнализПотребностиВРесурсах"

	Дано Я открываю основную форму отчета "ТСМ_АнализПотребностиВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_АнализПотребностиВРесурсах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"

	Дано Я открываю основную форму отчета "ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВладениеТехникойЭффективностьИспользования"

	Дано Я открываю основную форму отчета "ТСМ_ВладениеТехникойЭффективностьИспользования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВладениеТехникойЭффективностьИспользования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыгрузкаSpiderМатериалы"

	Дано Я открываю основную форму отчета "ТСМ_ВыгрузкаSpiderМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВыгрузкаSpiderМатериалы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыполненныеРаботыДляSpider"

	Дано Я открываю основную форму отчета "ТСМ_ВыполненныеРаботыДляSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВыполненныеРаботыДляSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"

	Дано Я открываю основную форму отчета "ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеЗаправокПоТопливнымКартам"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеЗаправокПоТопливнымКартам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеЗаправокПоТопливнымКартам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоАвариям"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоАвариям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоАвариям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоКоэффициентамМинтранса"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоКоэффициентамМинтранса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоКоэффициентамМинтранса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоПарковочнымМестам"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоПарковочнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоПарковочнымМестам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеТранспондеров"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеТранспондеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ТСМ_ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЛегковойТехники"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЛегковойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЛегковойТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейЗаТехникой"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЭкипажейЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЭкипажейЗаТехникой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаПитание"

	Дано Я открываю основную форму отчета "ТСМ_ЗаявкаНаПитание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗаявкаНаПитание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_КарточкаРаботыТехники"

	Дано Я открываю основную форму отчета "ТСМ_КарточкаРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_КарточкаРаботыТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_КоэффициентВыходаНаЛинию"

	Дано Я открываю основную форму отчета "ТСМ_КоэффициентВыходаНаЛинию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_КоэффициентВыходаНаЛинию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_МатериальныйОтчетКладовщикаПоТопливу"

	Дано Я открываю основную форму отчета "ТСМ_МатериальныйОтчетКладовщикаПоТопливу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_МатериальныйОтчетКладовщикаПоТопливу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"

	Дано Я открываю основную форму отчета "ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НаличиеТехникиНаТерриториях"

	Дано Я открываю основную форму отчета "ТСМ_НаличиеТехникиНаТерриториях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НаличиеТехникиНаТерриториях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НаработкаТехникиПоВодителямИМашинистам"

	Дано Я открываю основную форму отчета "ТСМ_НаработкаТехникиПоВодителямИМашинистам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НаработкаТехникиПоВодителямИМашинистам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НезакрепленныеВодителиМашинисты"

	Дано Я открываю основную форму отчета "ТСМ_НезакрепленныеВодителиМашинисты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НезакрепленныеВодителиМашинисты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОшибкиЗаполненияЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ОшибкиЗаполненияЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ОшибкиЗаполненияЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПережогиИАктыСписанияТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ПережогиИАктыСписанияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПережогиИАктыСписанияТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПоАктамИОтветственным"

	Дано Я открываю основную форму отчета "ТСМ_ПоАктамИОтветственным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПоАктамИОтветственным"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПотребностьВРесурсах"

	Дано Я открываю основную форму отчета "ТСМ_ПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПотребностьВРесурсах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПриказОЗакреплении"

	Дано Я открываю основную форму отчета "ТСМ_ПриказОЗакреплении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПриказОЗакреплении"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РаботаТехникиПоЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_РаботаТехникиПоЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РаботаТехникиПоЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиДляБухгалтерии"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиДляБухгалтерии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиДляБухгалтерии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиНаОбъекте"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиНаОбъекте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиНаОбъекте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиПоПикетам"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиПоПикетам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасчетПотребностиПоПериодам"

	Дано Я открываю основную форму отчета "ТСМ_РасчетПотребностиПоПериодам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасчетПотребностиПоПериодам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрАктовУслугПривлеченнаяТехника"

	Дано Я открываю основную форму отчета "ТСМ_РеестрАктовУслугПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрАктовУслугПривлеченнаяТехника"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПеревозокТехники"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПеревозокТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПеревозокТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПеревозокТехникиМеждуПикетами"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПеревозокТехникиМеждуПикетами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПеревозокТехникиМеждуПикетами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"

	Дано Я открываю основную форму отчета "ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СверкаСоСпайдер"

	Дано Я открываю основную форму отчета "ТСМ_СверкаСоСпайдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СверкаСоСпайдер"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"

	Дано Я открываю основную форму отчета "ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СправкаОВакансиях"

	Дано Я открываю основную форму отчета "ТСМ_СправкаОВакансиях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СправкаОВакансиях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"

	Дано Я открываю основную форму отчета "ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"

	Дано Я открываю основную форму отчета "ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СтатистикаИспользованияОтчетов"

	Дано Я открываю основную форму отчета "ТСМ_СтатистикаИспользованияОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СтатистикаИспользованияОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СтатусыПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_СтатусыПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СтатусыПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ТабельПоПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_ТабельПоПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ТабельПоПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ТехникаНеНайденаВЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ТехникаНеНайденаВЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ТехникаНеНайденаВЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_УслугиОказываемыеФизическимЛицам"

	Дано Я открываю основную форму отчета "ТСМ_УслугиОказываемыеФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_УслугиОказываемыеФизическимЛицам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ФактическиВыполненныеРаботыДляSpider"

	Дано Я открываю основную форму отчета "ТСМ_ФактическиВыполненныеРаботыДляSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ФактическиВыполненныеРаботыДляSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЭффективностьИспользованияРесурсов"

	Дано Я открываю основную форму отчета "ТСМ_ЭффективностьИспользованияРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЭффективностьИспользованияРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЭффективностьРесурсовЛюди6_2"

	Дано Я открываю основную форму отчета "ТСМ_ЭффективностьРесурсовЛюди6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЭффективностьРесурсовЛюди6_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольОтчетов"

	Дано Я открываю основную форму отчета "УИ_КонсольОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УИ_КонсольОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_АнализПравДоступа"

	Дано Я открываю основную форму отчета "ИТК_АнализПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_АнализПравДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_МониторЛицензий"

	Дано Я открываю основную форму отчета "ИТК_МониторЛицензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_МониторЛицензий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_СравнениеОбъектов"

	Дано Я открываю основную форму отчета "ИТК_СравнениеОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_СравнениеОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"

	Дано Я открываю основную форму обработки "ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонсольЗапросовУФ"

	Дано Я открываю основную форму обработки "КонсольЗапросовУФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонсольЗапросовУФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпИнтерактивнаяОстановкаМенеджеровПотоков"

	Дано Я открываю основную форму обработки "мпИнтерактивнаяОстановкаМенеджеровПотоков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпИнтерактивнаяОстановкаМенеджеровПотоков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъект"

	Дано Я открываю основную форму обработки "мпОбработатьОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектОшибкаПриОбработке"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектОшибкаПриОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектОшибкаПриОбработке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектПередачаЧастныхПараметров"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектПередачаЧастныхПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектПередачаЧастныхПараметров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектФайлыГрафаGephi"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектФайлыГрафаGephi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектФайлыГрафаGephi"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииАвтосборка"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииАвтосборка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииАвтосборка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПроизвольнаяСборка"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПроизвольнаяСборка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПроизвольнаяСборка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПростая"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПростая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПростая"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСтандартногоИнтерфейсаOData"

	Дано Я открываю основную форму обработки "НастройкаСтандартногоИнтерфейсаOData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСтандартногоИнтерфейсаOData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеВспомогательныхДанных"

	Дано Я открываю основную форму обработки "ОбновлениеВспомогательныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеВспомогательныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Обработка1"

	Дано Я открываю основную форму обработки "Обработка1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Обработка1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОписаниеОбработчиковОбновления"

	Дано Я открываю основную форму обработки "ОписаниеОбработчиковОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОписаниеОбработчиковОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСПВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСПВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСПВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереносФайлов"

	Дано Я открываю основную форму обработки "ПереносФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"

	Дано Я открываю основную форму обработки "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияАвтономногоРабочегоМеста"

	Дано Я открываю основную форму обработки "ПомощникСозданияАвтономногоРабочегоМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияАвтономногоРабочегоМеста"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТелеграмПолучениеОбновлений"

	Дано Я открываю основную форму обработки "ТелеграмПолучениеОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТелеграмПолучениеОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_КонсольКода"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_КонсольКода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_КонсольКода"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_КонсольУправления"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_КонсольУправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_КонсольУправления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_АРМДиспетчера"

	Дано Я открываю основную форму обработки "ТСМ_АРМДиспетчера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_АРМДиспетчера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_БлокировкаПериодовЖУФВР"

	Дано Я открываю основную форму обработки "ТСМ_БлокировкаПериодовЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_БлокировкаПериодовЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыгрузкаВSpiderЗаПериод"

	Дано Я открываю основную форму обработки "ТСМ_ВыгрузкаВSpiderЗаПериод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ВыгрузкаВSpiderЗаПериод"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаИзSpider"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаИзSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаИзSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ИзменениеДатыЖУФВР"

	Дано Я открываю основную форму обработки "ТСМ_ИзменениеДатыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ИзменениеДатыЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"

	Дано Я открываю основную форму обработки "ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"

	Дано Я открываю основную форму обработки "ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОткрытьПолныйСписокТерриторий"

	Дано Я открываю основную форму обработки "ТСМ_ОткрытьПолныйСписокТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ОткрытьПолныйСписокТерриторий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьЖурналаПутевойДокументации"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьЖурналаПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьЖурналаПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"

	Дано Я открываю основную форму обработки "ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеанимацияПодчиненногоУзла"

	Дано Я открываю основную форму обработки "ТСМ_РеанимацияПодчиненногоУзла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_РеанимацияПодчиненногоУзла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаСпайдерОтчеты"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаСпайдерОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаСпайдерОтчеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ГрупповаяОбработкаСправочниковИДокументов"

	Дано Я открываю основную форму обработки "УИ_ГрупповаяОбработкаСправочниковИДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ГрупповаяОбработкаСправочниковИДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторКонстант"

	Дано Я открываю основную форму обработки "УИ_РедакторКонстант"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторКонстант"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_СтруктураХраненияБазыДанных"

	Дано Я открываю основную форму обработки "УИ_СтруктураХраненияБазыДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_СтруктураХраненияБазыДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УИ_УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"

	Дано Я открываю основную форму обработки "УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольЗапросов"

	Дано Я открываю основную форму обработки "УИ_КонсольЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольЗапросов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольЗаданий"

	Дано Я открываю основную форму обработки "УИ_КонсольЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольЗаданий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "УИ_РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольКода"

	Дано Я открываю основную форму обработки "УИ_КонсольКода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольКода"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "УИ_ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПоискСсылокНаОбъект"

	Дано Я открываю основную форму обработки "УИ_ПоискСсылокНаОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПоискСсылокНаОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ТехПоддержка"

	Дано Я открываю основную форму обработки "УИ_ТехПоддержка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ТехПоддержка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторРеквизитовОбъекта"

	Дано Я открываю основную форму обработки "УИ_РедакторРеквизитовОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторРеквизитовОбъекта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ДинамическийСписок"

	Дано Я открываю основную форму обработки "УИ_ДинамическийСписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ДинамическийСписок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольHTTPЗапросов"

	Дано Я открываю основную форму обработки "УИ_КонсольHTTPЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольHTTPЗапросов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"

	Дано Я открываю основную форму обработки "УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПреобразованиеДанныхJSON"

	Дано Я открываю основную форму обработки "УИ_ПреобразованиеДанныхJSON"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПреобразованиеДанныхJSON"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонструкторРегулярныхВыражений"

	Дано Я открываю основную форму обработки "УИ_КонструкторРегулярныхВыражений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонструкторРегулярныхВыражений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_НавигаторПоКонфигурации"

	Дано Я открываю основную форму обработки "УИ_НавигаторПоКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_НавигаторПоКонфигурации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ФайловыйМенеджер"

	Дано Я открываю основную форму обработки "УИ_ФайловыйМенеджер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ФайловыйМенеджер"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольСравненияДанных"

	Дано Я открываю основную форму обработки "УИ_КонсольСравненияДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольСравненияДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ИнформацияОЛицензиях1С"

	Дано Я открываю основную форму обработки "УИ_ИнформацияОЛицензиях1С"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ИнформацияОЛицензиях1С"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольВебСервисов"

	Дано Я открываю основную форму обработки "УИ_КонсольВебСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольВебСервисов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ЗагрузкаДанныхИзТабличногоДокумента"

	Дано Я открываю основную форму обработки "УИ_ЗагрузкаДанныхИзТабличногоДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ЗагрузкаДанныхИзТабличногоДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ДанныеДляОтладки"

	Дано Я открываю основную форму обработки "УИ_ДанныеДляОтладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ДанныеДляОтладки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_МенеджерХранилищНастроек"

	Дано Я открываю основную форму обработки "УИ_МенеджерХранилищНастроек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_МенеджерХранилищНастроек"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторJSON"

	Дано Я открываю основную форму обработки "УИ_РедакторJSON"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторJSON"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторHTML"

	Дано Я открываю основную форму обработки "УИ_РедакторHTML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторHTML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УИ_УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторСКД"

	Дано Я открываю основную форму обработки "УИ_РедакторСКД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторСКД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_СравнениеОбъектов"

	Дано Я открываю основную форму обработки "УИ_СравнениеОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_СравнениеОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard10"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard10"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard10"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard11"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard12"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard12"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard12"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard13"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard14"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard14"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard14"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard15"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard15"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard15"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard16"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard16"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard16"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard1718192021"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard1718192021"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard1718192021"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ВсеФункции"

	Дано Я открываю основную форму обработки "ИТК_ВсеФункции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ВсеФункции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ГлобальноеМеню"

	Дано Я открываю основную форму обработки "ИТК_ГлобальноеМеню"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ГлобальноеМеню"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ДинамическийСписок"

	Дано Я открываю основную форму обработки "ИТК_ДинамическийСписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ДинамическийСписок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ИТК_ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонсольРазработчика"

	Дано Я открываю основную форму обработки "ИТК_КонсольРазработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонсольРазработчика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонструкторСКД"

	Дано Я открываю основную форму обработки "ИТК_КонструкторСКД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонструкторСКД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонструкторСтрокиОтладки"

	Дано Я открываю основную форму обработки "ИТК_КонструкторСтрокиОтладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонструкторСтрокиОтладки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_Поддержка"

	Дано Я открываю основную форму обработки "ИТК_Поддержка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_Поддержка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПодпискиНаСобытия"

	Дано Я открываю основную форму обработки "ИТК_ПодпискиНаСобытия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПодпискиНаСобытия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПоискИЗаменаСсылок"

	Дано Я открываю основную форму обработки "ИТК_ПоискИЗаменаСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПоискИЗаменаСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПоискСсылокНаОбъект"

	Дано Я открываю основную форму обработки "ИТК_ПоискСсылокНаОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПоискСсылокНаОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_Пользователи"

	Дано Я открываю основную форму обработки "ИТК_Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_Пользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "ИТК_РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторКонстант"

	Дано Я открываю основную форму обработки "ИТК_РедакторКонстант"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторКонстант"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторОбъекта"

	Дано Я открываю основную форму обработки "ИТК_РедакторОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторОбъекта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторПараметровСеанса"

	Дано Я открываю основную форму обработки "ИТК_РедакторПараметровСеанса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторПараметровСеанса"
	И Я закрываю текущее окно

