#language: ru

@tree

Функционал: Проверка открытия форм справочников.

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтветовАнкет" 

	Дано Я открываю основную форму списка справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтветовАнкет"

	Дано Я открываю основную форму справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыОтчетов"

	Дано Я открываю основную форму справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПроверок" 

	Дано Я открываю основную форму списка справочника "ВидыПроверок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПроверок"

	Дано Я открываю основную форму справочника "ВидыПроверок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВстречаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВстречаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрайверыОборудования" 

	Дано Я открываю основную форму списка справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрайверыОборудования"

	Дано Я открываю основную форму справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Заметки" 

	Дано Я открываю основную форму списка справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Заметки"

	Дано Я открываю основную форму справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторЕдиницИзмерения" 

	Дано Я открываю основную форму списка справочника "КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторЕдиницИзмерения"

	Дано Я открываю основную форму справочника "КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступа" 

	Дано Я открываю основную форму списка справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступа"

	Дано Я открываю основную форму справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыГруппДоступа" 

	Дано Я открываю основную форму списка справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыГруппДоступа"

	Дано Я открываю основную форму справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиЭлектронныхПисем" 

	Дано Я открываю основную форму списка справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиЭлектронныхПисем"

	Дано Я открываю основную форму справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПодключаемоеОборудование" 

	Дано Я открываю основную форму списка справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПодключаемоеОборудование"

	Дано Я открываю основную форму справочника "ПодключаемоеОборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПодключаемоеОборудование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ПоставляемыеДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбработкиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбработкиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПроверкиУчета" 

	Дано Я открываю основную форму списка справочника "ПравилаПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаПроверкиУчета"

	Дано Я открываю основную форму справочника "ПравилаПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМеста" 

	Дано Я открываю основную форму списка справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМеста"

	Дано Я открываю основную форму справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMSПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMSПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОригиналовПервичныхДокументов" 

	Дано Я открываю основную форму списка справочника "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОригиналовПервичныхДокументов"

	Дано Я открываю основную форму справочника "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмБоты" 

	Дано Я открываю основную форму списка справочника "ТелеграмБоты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмБоты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмБоты"

	Дано Я открываю основную форму справочника "ТелеграмБоты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмБоты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмКлавиатуры" 

	Дано Я открываю основную форму списка справочника "ТелеграмКлавиатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмКлавиатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмКлавиатуры"

	Дано Я открываю основную форму справочника "ТелеграмКлавиатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмКлавиатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмМетоды" 

	Дано Я открываю основную форму списка справочника "ТелеграмМетоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмМетоды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмМетоды"

	Дано Я открываю основную форму справочника "ТелеграмМетоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмМетоды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмНастройкиПрокси" 

	Дано Я открываю основную форму списка справочника "ТелеграмНастройкиПрокси"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмНастройкиПрокси"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмНастройкиПрокси"

	Дано Я открываю основную форму справочника "ТелеграмНастройкиПрокси"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмНастройкиПрокси"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмОбработки" 

	Дано Я открываю основную форму списка справочника "ТелеграмОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмОбработки"

	Дано Я открываю основную форму справочника "ТелеграмОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмСервисы" 

	Дано Я открываю основную форму списка справочника "ТелеграмСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмСервисы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмСервисы"

	Дано Я открываю основную форму справочника "ТелеграмСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмСервисы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмФрагменты" 

	Дано Я открываю основную форму списка справочника "ТелеграмФрагменты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмФрагменты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмФрагменты"

	Дано Я открываю основную форму справочника "ТелеграмФрагменты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмФрагменты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмЧатыПользователи" 

	Дано Я открываю основную форму списка справочника "ТелеграмЧатыПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмЧатыПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмЧатыПользователи"

	Дано Я открываю основную форму справочника "ТелеграмЧатыПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелеграмЧатыПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ИнформационныеБазыТСМ" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_ИнформационныеБазыТСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_ИнформационныеБазыТСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ИнформационныеБазыТСМ"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_ИнформационныеБазыТСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_ИнформационныеБазыТСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ИсходящиеСообщения" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_ИсходящиеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_ИсходящиеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ИсходящиеСообщения"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_ИсходящиеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_ИсходящиеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_КастомныеЗапросы" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_КастомныеЗапросы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_КастомныеЗапросы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_КастомныеЗапросы"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_КастомныеЗапросы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_КастомныеЗапросы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_НастройкаВыгрузкиОбъектов" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_НастройкаВыгрузкиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_НастройкаВыгрузкиОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_НастройкаВыгрузкиОбъектов"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_НастройкаВыгрузкиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_НастройкаВыгрузкиОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_НастройкаЗагрузкиОбъектов" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_НастройкаЗагрузкиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_НастройкаЗагрузкиОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_НастройкаЗагрузкиОбъектов"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_НастройкаЗагрузкиОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_НастройкаЗагрузкиОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_СерверыОчередей" 

	Дано Я открываю основную форму списка справочника "ТСМ_RMQ_СерверыОчередей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_СерверыОчередей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_СерверыОчередей"

	Дано Я открываю основную форму справочника "ТСМ_RMQ_СерверыОчередей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_RMQ_СерверыОчередей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_WEBАдреса" 

	Дано Я открываю основную форму списка справочника "ТСМ_WEBАдреса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_WEBАдреса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_WEBАдреса"

	Дано Я открываю основную форму справочника "ТСМ_WEBАдреса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_WEBАдреса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АварияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_АварияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АварияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АварияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_АварияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АварияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АктОСбоеСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_АктУстановкиНормМаршрутовТехникиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_БазовыеКлассы" 

	Дано Я открываю основную форму списка справочника "ТСМ_БазовыеКлассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_БазовыеКлассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_БазовыеКлассы"

	Дано Я открываю основную форму справочника "ТСМ_БазовыеКлассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_БазовыеКлассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВерсииЖУФВР" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВерсииЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВерсииЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВерсииЖУФВР"

	Дано Я открываю основную форму справочника "ТСМ_ВерсииЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВерсииЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидеоСправка" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидеоСправка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидеоСправка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидеоСправка"

	Дано Я открываю основную форму справочника "ТСМ_ВидеоСправка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидеоСправка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыДоговоров" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыДоговоров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыДоговоров"

	Дано Я открываю основную форму справочника "ТСМ_ВидыДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыДоговоров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыКлассов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыКлассов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыКлассов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыКлассов"

	Дано Я открываю основную форму справочника "ТСМ_ВидыКлассов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыКлассов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыНаправленийДеятельности" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыНаправленийДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыНаправленийДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыНаправленийДеятельности"

	Дано Я открываю основную форму справочника "ТСМ_ВидыНаправленийДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыНаправленийДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыНоменклатуры"

	Дано Я открываю основную форму справочника "ТСМ_ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыПикетов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыПикетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыПикетов"

	Дано Я открываю основную форму справочника "ТСМ_ВидыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыПикетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыПоправочныхКоэффициентов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыПоправочныхКоэффициентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыПоправочныхКоэффициентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыПоправочныхКоэффициентов"

	Дано Я открываю основную форму справочника "ТСМ_ВидыПоправочныхКоэффициентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыПоправочныхКоэффициентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыРабот" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыРабот"

	Дано Я открываю основную форму справочника "ТСМ_ВидыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыРегистрационныхДокументов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыРегистрационныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыРегистрационныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыРегистрационныхДокументов"

	Дано Я открываю основную форму справочника "ТСМ_ВидыРегистрационныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыРегистрационныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыСообщений" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыСообщений"

	Дано Я открываю основную форму справочника "ТСМ_ВидыСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыСчетчиков" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыСчетчиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыСчетчиков"

	Дано Я открываю основную форму справочника "ТСМ_ВидыСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыСчетчиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыУслугПривлеченнойТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВидыУслугПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыУслугПривлеченнойТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыУслугПривлеченнойТехники"

	Дано Я открываю основную форму справочника "ТСМ_ВидыУслугПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВидыУслугПривлеченнойТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыданныеДокументы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВыданныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВыданныеДокументы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыданныеДокументы"

	Дано Я открываю основную форму справочника "ТСМ_ВыданныеДокументы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВыданныеДокументы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыданныеДокументыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ВыданныеДокументыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВыданныеДокументыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыданныеДокументыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ВыданныеДокументыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ВыданныеДокументыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Гаражи" 

	Дано Я открываю основную форму списка справочника "ТСМ_Гаражи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Гаражи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Гаражи"

	Дано Я открываю основную форму справочника "ТСМ_Гаражи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Гаражи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГосударственныеКонтракты" 

	Дано Я открываю основную форму списка справочника "ТСМ_ГосударственныеКонтракты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГосударственныеКонтракты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГосударственныеКонтракты"

	Дано Я открываю основную форму справочника "ТСМ_ГосударственныеКонтракты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГосударственныеКонтракты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГрафикиРаботы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГрафикиРаботы"

	Дано Я открываю основную форму справочника "ТСМ_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГрафикиРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГрафикиРаботыТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_ГрафикиРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГрафикиРаботыТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГрафикиРаботыТехники"

	Дано Я открываю основную форму справочника "ТСМ_ГрафикиРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГрафикиРаботыТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Грузы" 

	Дано Я открываю основную форму списка справочника "ТСМ_Грузы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Грузы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Грузы"

	Дано Я открываю основную форму справочника "ТСМ_Грузы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Грузы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГруппыПикетов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ГруппыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГруппыПикетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГруппыПикетов"

	Дано Я открываю основную форму справочника "ТСМ_ГруппыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ГруппыПикетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДиспетчерскиеЦентры" 

	Дано Я открываю основную форму списка справочника "ТСМ_ДиспетчерскиеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДиспетчерскиеЦентры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДиспетчерскиеЦентры"

	Дано Я открываю основную форму справочника "ТСМ_ДиспетчерскиеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДиспетчерскиеЦентры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДоговорыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДоговорыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДоговорыКонтрагентов"

	Дано Я открываю основную форму справочника "ТСМ_ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДоговорыКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДоговорыКонтрагентовПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДолжностиОрганизаций" 

	Дано Я открываю основную форму списка справочника "ТСМ_ДолжностиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДолжностиОрганизаций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДолжностиОрганизаций"

	Дано Я открываю основную форму справочника "ТСМ_ДолжностиОрганизаций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДолжностиОрганизаций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДополнительныеПредметыЗаявок" 

	Дано Я открываю основную форму списка справочника "ТСМ_ДополнительныеПредметыЗаявок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДополнительныеПредметыЗаявок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДополнительныеПредметыЗаявок"

	Дано Я открываю основную форму справочника "ТСМ_ДополнительныеПредметыЗаявок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ДополнительныеПредметыЗаявок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЖУФВРПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЖУФВРПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЖУФВРПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЖУФВРПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ЖУФВРПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЖУФВРПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗаявкаНаВыдачуТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудниковПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗначенияПоправочныхКоэффициентов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЗначенияПоправочныхКоэффициентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗначенияПоправочныхКоэффициентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗначенияПоправочныхКоэффициентов"

	Дано Я открываю основную форму справочника "ТСМ_ЗначенияПоправочныхКоэффициентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗначенияПоправочныхКоэффициентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗонаОтветственности" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЗонаОтветственности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗонаОтветственности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗонаОтветственности"

	Дано Я открываю основную форму справочника "ТСМ_ЗонаОтветственности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЗонаОтветственности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ИдентификационныеУстройства" 

	Дано Я открываю основную форму списка справочника "ТСМ_ИдентификационныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ИдентификационныеУстройства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ИдентификационныеУстройства"

	Дано Я открываю основную форму справочника "ТСМ_ИдентификационныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ИдентификационныеУстройства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ИменаПредопределенныхОбъектов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ИменаПредопределенныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ИменаПредопределенныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ИменаПредопределенныхОбъектов"

	Дано Я открываю основную форму справочника "ТСМ_ИменаПредопределенныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ИменаПредопределенныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КатегорииВидовРегистрационныхДокументов" 

	Дано Я открываю основную форму списка справочника "ТСМ_КатегорииВидовРегистрационныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииВидовРегистрационныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КатегорииВидовРегистрационныхДокументов"

	Дано Я открываю основную форму справочника "ТСМ_КатегорииВидовРегистрационныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииВидовРегистрационныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КатегорииДолжностей" 

	Дано Я открываю основную форму списка справочника "ТСМ_КатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииДолжностей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КатегорииДолжностей"

	Дано Я открываю основную форму справочника "ТСМ_КатегорииДолжностей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииДолжностей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КатегорииЗакрепленияТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_КатегорииЗакрепленияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииЗакрепленияТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КатегорииЗакрепленияТехники"

	Дано Я открываю основную форму справочника "ТСМ_КатегорииЗакрепленияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КатегорииЗакрепленияТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КлассыОбъектовЭксплуатации" 

	Дано Я открываю основную форму списка справочника "ТСМ_КлассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КлассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КлассыОбъектовЭксплуатации"

	Дано Я открываю основную форму справочника "ТСМ_КлассыОбъектовЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КлассыОбъектовЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КлючиОтветственныхЗаВыезд" 

	Дано Я открываю основную форму списка справочника "ТСМ_КлючиОтветственныхЗаВыезд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КлючиОтветственныхЗаВыезд"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КлючиОтветственныхЗаВыезд"

	Дано Я открываю основную форму справочника "ТСМ_КлючиОтветственныхЗаВыезд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КлючиОтветственныхЗаВыезд"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Колонны" 

	Дано Я открываю основную форму списка справочника "ТСМ_Колонны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Колонны"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Колонны"

	Дано Я открываю основную форму справочника "ТСМ_Колонны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Колонны"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КомплекностьИнструментаИДополнительногоОборудования" 

	Дано Я открываю основную форму списка справочника "ТСМ_КомплекностьИнструментаИДополнительногоОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КомплекностьИнструментаИДополнительногоОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КомплекностьИнструментаИДополнительногоОборудования"

	Дано Я открываю основную форму справочника "ТСМ_КомплекностьИнструментаИДополнительногоОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_КомплекностьИнструментаИДополнительногоОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Контрагенты" 

	Дано Я открываю основную форму списка справочника "ТСМ_Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Контрагенты"

	Дано Я открываю основную форму справочника "ТСМ_Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_МаршрутыТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_МаршрутыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_МаршрутыТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_МаршрутыТехники"

	Дано Я открываю основную форму справочника "ТСМ_МаршрутыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_МаршрутыТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_МоделиДвигателей" 

	Дано Я открываю основную форму списка справочника "ТСМ_МоделиДвигателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_МоделиДвигателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_МоделиДвигателей"

	Дано Я открываю основную форму справочника "ТСМ_МоделиДвигателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_МоделиДвигателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НаправленияДеятельности" 

	Дано Я открываю основную форму списка справочника "ТСМ_НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_НаправленияДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НаправленияДеятельности"

	Дано Я открываю основную форму справочника "ТСМ_НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_НаправленияДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НастройкиТелеграм" 

	Дано Я открываю основную форму списка справочника "ТСМ_НастройкиТелеграм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_НастройкиТелеграм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НастройкиТелеграм"

	Дано Я открываю основную форму справочника "ТСМ_НастройкиТелеграм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_НастройкиТелеграм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Номенклатура" 

	Дано Я открываю основную форму списка справочника "ТСМ_Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Номенклатура"

	Дано Я открываю основную форму справочника "ТСМ_Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Номенклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОператорыАвтодорог" 

	Дано Я открываю основную форму списка справочника "ТСМ_ОператорыАвтодорог"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ОператорыАвтодорог"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОператорыАвтодорог"

	Дано Я открываю основную форму справочника "ТСМ_ОператорыАвтодорог"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ОператорыАвтодорог"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Организации" 

	Дано Я открываю основную форму списка справочника "ТСМ_Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Организации"

	Дано Я открываю основную форму справочника "ТСМ_Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПавильоныПарковочныхМест" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПавильоныПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПавильоныПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПавильоныПарковочныхМест"

	Дано Я открываю основную форму справочника "ТСМ_ПавильоныПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПавильоныПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПараметрыВнешнихИсточниковДанных" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПараметрыВнешнихИсточниковДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыВнешнихИсточниковДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПараметрыВнешнихИсточниковДанных"

	Дано Я открываю основную форму справочника "ТСМ_ПараметрыВнешнихИсточниковДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыВнешнихИсточниковДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПараметрыНаработкиЕРП" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПараметрыНаработкиЕРП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыНаработкиЕРП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПараметрыНаработкиЕРП"

	Дано Я открываю основную форму справочника "ТСМ_ПараметрыНаработкиЕРП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыНаработкиЕРП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПараметрыНаработкиТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПараметрыНаработкиТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыНаработкиТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПараметрыНаработкиТехники"

	Дано Я открываю основную форму справочника "ТСМ_ПараметрыНаработкиТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПараметрыНаработкиТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПарковочныеМеста" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПарковочныеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПарковочныеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПарковочныеМеста"

	Дано Я открываю основную форму справочника "ТСМ_ПарковочныеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПарковочныеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПередачаТранспондеровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПередачаТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПередачаТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПередачаТранспондеровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ПередачаТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПередачаТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПОДЗАМЕНУ" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПОДЗАМЕНУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПОДЗАМЕНУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПОДЗАМЕНУ"

	Дано Я открываю основную форму справочника "ТСМ_ПОДЗАМЕНУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПОДЗАМЕНУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Подразделения" 

	Дано Я открываю основную форму списка справочника "ТСМ_Подразделения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Подразделения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Подразделения"

	Дано Я открываю основную форму справочника "ТСМ_Подразделения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Подразделения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПредметыПеревозок" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПредметыПеревозок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПредметыПеревозок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПредметыПеревозок"

	Дано Я открываю основную форму справочника "ТСМ_ПредметыПеревозок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПредметыПеревозок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПриходТранспондеровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПриходТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПриходТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПриходТранспондеровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_ПриходТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПриходТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПричиныОтказаПредоставленияТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПричиныОтказаПредоставленияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПричиныОтказаПредоставленияТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПричиныОтказаПредоставленияТехники"

	Дано Я открываю основную форму справочника "ТСМ_ПричиныОтказаПредоставленияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПричиныОтказаПредоставленияТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПричиныПростоя" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПричиныПростоя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПричиныПростоя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПричиныПростоя"

	Дано Я открываю основную форму справочника "ТСМ_ПричиныПростоя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПричиныПростоя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПроверкиВАлгоритмах" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПроверкиВАлгоритмах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПроверкиВАлгоритмах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПроверкиВАлгоритмах"

	Дано Я открываю основную форму справочника "ТСМ_ПроверкиВАлгоритмах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПроверкиВАлгоритмах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПроизводителиТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПроизводителиТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПроизводителиТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПроизводителиТехники"

	Дано Я открываю основную форму справочника "ТСМ_ПроизводителиТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПроизводителиТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПропускаПарковочныхМест" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПропускаПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПропускаПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПропускаПарковочныхМест"

	Дано Я открываю основную форму справочника "ТСМ_ПропускаПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПропускаПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПунктыНазначения" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПунктыНазначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПунктыНазначения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПунктыНазначения"

	Дано Я открываю основную форму справочника "ТСМ_ПунктыНазначения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПунктыНазначения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПунктыПДД" 

	Дано Я открываю основную форму списка справочника "ТСМ_ПунктыПДД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПунктыПДД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПунктыПДД"

	Дано Я открываю основную форму справочника "ТСМ_ПунктыПДД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ПунктыПДД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РаботыСМИАТ" 

	Дано Я открываю основную форму списка справочника "ТСМ_РаботыСМИАТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РаботыСМИАТ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РаботыСМИАТ"

	Дано Я открываю основную форму справочника "ТСМ_РаботыСМИАТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РаботыСМИАТ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Регионы" 

	Дано Я открываю основную форму списка справочника "ТСМ_Регионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Регионы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Регионы"

	Дано Я открываю основную форму справочника "ТСМ_Регионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Регионы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацииВНалоговомОргане" 

	Дано Я открываю основную форму списка справочника "ТСМ_РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацииВНалоговомОргане"

	Дано Я открываю основную форму справочника "ТСМ_РегистрацииВНалоговомОргане"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РегистрацииВНалоговомОргане"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РесурсыSpider" 

	Дано Я открываю основную форму списка справочника "ТСМ_РесурсыSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РесурсыSpider"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РесурсыSpider"

	Дано Я открываю основную форму справочника "ТСМ_РесурсыSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РесурсыSpider"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РолиФизЛицВСобытии" 

	Дано Я открываю основную форму списка справочника "ТСМ_РолиФизЛицВСобытии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РолиФизЛицВСобытии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РолиФизЛицВСобытии"

	Дано Я открываю основную форму справочника "ТСМ_РолиФизЛицВСобытии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_РолиФизЛицВСобытии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СервераКубики" 

	Дано Я открываю основную форму списка справочника "ТСМ_СервераКубики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СервераКубики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СервераКубики"

	Дано Я открываю основную форму справочника "ТСМ_СервераКубики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СервераКубики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Склады" 

	Дано Я открываю основную форму списка справочника "ТСМ_Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Склады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Склады"

	Дано Я открываю основную форму справочника "ТСМ_Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Склады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Смены" 

	Дано Я открываю основную форму списка справочника "ТСМ_Смены"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Смены"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Смены"

	Дано Я открываю основную форму справочника "ТСМ_Смены"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Смены"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТранспондеровПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТСМ_СписаниеТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СписаниеТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТранспондеровПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТСМ_СписаниеТранспондеровПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СписаниеТранспондеровПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СпискиСогласующих" 

	Дано Я открываю основную форму списка справочника "ТСМ_СпискиСогласующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СпискиСогласующих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СпискиСогласующих"

	Дано Я открываю основную форму справочника "ТСМ_СпискиСогласующих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СпискиСогласующих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтавкиНДС" 

	Дано Я открываю основную форму списка справочника "ТСМ_СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтавкиНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтавкиНДС"

	Дано Я открываю основную форму справочника "ТСМ_СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтавкиНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатусыНаличияТехники" 

	Дано Я открываю основную форму списка справочника "ТСМ_СтатусыНаличияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтатусыНаличияТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатусыНаличияТехники"

	Дано Я открываю основную форму справочника "ТСМ_СтатусыНаличияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтатусыНаличияТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатьиЗатрат" 

	Дано Я открываю основную форму списка справочника "ТСМ_СтатьиЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтатьиЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатьиЗатрат"

	Дано Я открываю основную форму справочника "ТСМ_СтатьиЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтатьиЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтруктураРабот" 

	Дано Я открываю основную форму списка справочника "ТСМ_СтруктураРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтруктураРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтруктураРабот"

	Дано Я открываю основную форму справочника "ТСМ_СтруктураРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_СтруктураРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТарифныеРазряды" 

	Дано Я открываю основную форму списка справочника "ТСМ_ТарифныеРазряды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТарифныеРазряды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТарифныеРазряды"

	Дано Я открываю основную форму справочника "ТСМ_ТарифныеРазряды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТарифныеРазряды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Территории" 

	Дано Я открываю основную форму списка справочника "ТСМ_Территории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Территории"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Территории"

	Дано Я открываю основную форму справочника "ТСМ_Территории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Территории"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Техника" 

	Дано Я открываю основную форму списка справочника "ТСМ_Техника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Техника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Техника"

	Дано Я открываю основную форму справочника "ТСМ_Техника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_Техника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТипыПикетов" 

	Дано Я открываю основную форму списка справочника "ТСМ_ТипыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТипыПикетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТипыПикетов"

	Дано Я открываю основную форму справочника "ТСМ_ТипыПикетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТипыПикетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТипыШасси" 

	Дано Я открываю основную форму списка справочника "ТСМ_ТипыШасси"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТипыШасси"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТипыШасси"

	Дано Я открываю основную форму справочника "ТСМ_ТипыШасси"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТипыШасси"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТопливныеКарты" 

	Дано Я открываю основную форму списка справочника "ТСМ_ТопливныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТопливныеКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТопливныеКарты"

	Дано Я открываю основную форму справочника "ТСМ_ТопливныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТопливныеКарты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТрудовыеРесурсыЖУФВР" 

	Дано Я открываю основную форму списка справочника "ТСМ_ТрудовыеРесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТрудовыеРесурсыЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТрудовыеРесурсыЖУФВР"

	Дано Я открываю основную форму справочника "ТСМ_ТрудовыеРесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ТрудовыеРесурсыЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УниверсальныеДистанции" 

	Дано Я открываю основную форму списка справочника "ТСМ_УниверсальныеДистанции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УниверсальныеДистанции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УниверсальныеДистанции"

	Дано Я открываю основную форму справочника "ТСМ_УниверсальныеДистанции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УниверсальныеДистанции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УслугиИСервисы" 

	Дано Я открываю основную форму списка справочника "ТСМ_УслугиИСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УслугиИСервисы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УслугиИСервисы"

	Дано Я открываю основную форму справочника "ТСМ_УслугиИСервисы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УслугиИСервисы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УстройстваНавигациия" 

	Дано Я открываю основную форму списка справочника "ТСМ_УстройстваНавигациия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УстройстваНавигациия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УстройстваНавигациия"

	Дано Я открываю основную форму справочника "ТСМ_УстройстваНавигациия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УстройстваНавигациия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УчастникиДТП" 

	Дано Я открываю основную форму списка справочника "ТСМ_УчастникиДТП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УчастникиДТП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УчастникиДТП"

	Дано Я открываю основную форму справочника "ТСМ_УчастникиДТП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_УчастникиДТП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ФазыОбъектовСтроительства" 

	Дано Я открываю основную форму списка справочника "ТСМ_ФазыОбъектовСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФазыОбъектовСтроительства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ФазыОбъектовСтроительства"

	Дано Я открываю основную форму справочника "ТСМ_ФазыОбъектовСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФазыОбъектовСтроительства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "ТСМ_ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ФизическиеЛица"

	Дано Я открываю основную форму справочника "ТСМ_ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ФормулыРасчетаНормативногоРасходаГСМ" 

	Дано Я открываю основную форму списка справочника "ТСМ_ФормулыРасчетаНормативногоРасходаГСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФормулыРасчетаНормативногоРасходаГСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ФормулыРасчетаНормативногоРасходаГСМ"

	Дано Я открываю основную форму справочника "ТСМ_ФормулыРасчетаНормативногоРасходаГСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ФормулыРасчетаНормативногоРасходаГСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЭтажиПарковочныхМест" 

	Дано Я открываю основную форму списка справочника "ТСМ_ЭтажиПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЭтажиПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЭтажиПарковочныхМест"

	Дано Я открываю основную форму справочника "ТСМ_ЭтажиПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТСМ_ЭтажиПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТСМ_ГосНомераТехники" 

	Дано Я открываю основную форму списка справочника "УдалитьТСМ_ГосНомераТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТСМ_ГосНомераТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТСМ_ГосНомераТехники"

	Дано Я открываю основную форму справочника "УдалитьТСМ_ГосНомераТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТСМ_ГосНомераТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТСМ_СчитывалиИдентификационныхУстройств" 

	Дано Я открываю основную форму списка справочника "УдалитьТСМ_СчитывалиИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТСМ_СчитывалиИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТСМ_СчитывалиИдентификационныхУстройств"

	Дано Я открываю основную форму справочника "УдалитьТСМ_СчитывалиИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьТСМ_СчитывалиИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныМагнитныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныМагнитныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЯзыкиПечатныхФорм" 

	Дано Я открываю основную форму списка справочника "ЯзыкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЯзыкиПечатныхФорм"

	Дано Я открываю основную форму справочника "ЯзыкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЯзыкиПечатныхФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УИ_Алгоритмы" 

	Дано Я открываю основную форму списка справочника "УИ_Алгоритмы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УИ_Алгоритмы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УИ_Алгоритмы"

	Дано Я открываю основную форму справочника "УИ_Алгоритмы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УИ_Алгоритмы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Авария" 

	Дано Я открываю основную форму списка документа "ТСМ_Авария"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Авария"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Авария"

	Дано Я открываю основную форму документа "ТСМ_Авария"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Авария"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктОСбоеСчетчика" 

	Дано Я открываю основную форму списка документа "ТСМ_АктОСбоеСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктОСбоеСчетчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктОСбоеСчетчика"

	Дано Я открываю основную форму документа "ТСМ_АктОСбоеСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктОСбоеСчетчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктУслугиПривлеченнаяТехника" 

	Дано Я открываю основную форму списка документа "ТСМ_АктУслугиПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУслугиПривлеченнаяТехника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктУслугиПривлеченнаяТехника"

	Дано Я открываю основную форму документа "ТСМ_АктУслугиПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУслугиПривлеченнаяТехника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктУстановкиНормМаршрутовТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_АктУстановкиНормМаршрутовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУстановкиНормМаршрутовТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктУстановкиНормМаршрутовТехники"

	Дано Я открываю основную форму документа "ТСМ_АктУстановкиНормМаршрутовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУстановкиНормМаршрутовТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АннулированиеУслугВходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_АннулированиеУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугВходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АннулированиеУслугВходящих"

	Дано Я открываю основную форму документа "ТСМ_АннулированиеУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугВходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АннулированиеУслугИсходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_АннулированиеУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугИсходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АннулированиеУслугИсходящих"

	Дано Я открываю основную форму документа "ТСМ_АннулированиеУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугИсходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией" 

	Дано Я открываю основную форму списка документа "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"

	Дано Я открываю основную форму документа "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВозвратИдентификационныхУстройств" 

	Дано Я открываю основную форму списка документа "ТСМ_ВозвратИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВозвратИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВозвратИдентификационныхУстройств"

	Дано Я открываю основную форму документа "ТСМ_ВозвратИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВозвратИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике" 

	Дано Я открываю основную форму списка документа "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"

	Дано Я открываю основную форму документа "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыбытиеТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_ВыбытиеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыбытиеТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыбытиеТехники"

	Дано Я открываю основную форму документа "ТСМ_ВыбытиеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыбытиеТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыдачаИдентификационныхУстройств" 

	Дано Я открываю основную форму списка документа "ТСМ_ВыдачаИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыдачаИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыдачаИдентификационныхУстройств"

	Дано Я открываю основную форму документа "ТСМ_ВыдачаИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыдачаИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"

	Дано Я открываю основную форму документа "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЖУФВР" 

	Дано Я открываю основную форму списка документа "ТСМ_ЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЖУФВР"

	Дано Я открываю основную форму документа "ТСМ_ЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеТехникиПоПикетам" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоПикетам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеТехникиПоПикетам"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоПикетам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаправкаТехникиТопливом" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаправкаТехникиТопливом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаправкаТехникиТопливом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаправкаТехникиТопливом"

	Дано Я открываю основную форму документа "ТСМ_ЗаправкаТехникиТопливом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаправкаТехникиТопливом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаВыдачуТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаВыдачуТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаВыдачуТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаВыдачуТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаВыдачуТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаВыдачуТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаТехникуВнутренняя" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаТехникуВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаТехникуВнутренняя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаТехникуВнутренняя"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаТехникуВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаТехникуВнутренняя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "ТСМ_КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КорректировкаРегистров"

	Дано Я открываю основную форму документа "ТСМ_КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КорректировкаУслугИСервисов" 

	Дано Я открываю основную форму списка документа "ТСМ_КорректировкаУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаУслугИСервисов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КорректировкаУслугИСервисов"

	Дано Я открываю основную форму документа "ТСМ_КорректировкаУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаУслугИСервисов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Оприходование" 

	Дано Я открываю основную форму списка документа "ТСМ_Оприходование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Оприходование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Оприходование"

	Дано Я открываю основную форму документа "ТСМ_Оприходование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Оприходование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПередачаТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ПередачаТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередачаТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПередачаТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ПередачаТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередачаТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПередислокацияТехникиФакт" 

	Дано Я открываю основную форму списка документа "ТСМ_ПередислокацияТехникиФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередислокацияТехникиФакт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПередислокацияТехникиФакт"

	Дано Я открываю основную форму документа "ТСМ_ПередислокацияТехникиФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередислокацияТехникиФакт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Перемещение" 

	Дано Я открываю основную форму списка документа "ТСМ_Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Перемещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Перемещение"

	Дано Я открываю основную форму документа "ТСМ_Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Перемещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПеремещениеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_ПеремещениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПеремещениеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПеремещениеТоплива"

	Дано Я открываю основную форму документа "ТСМ_ПеремещениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПеремещениеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПлановаяПотребностьВРесурсах" 

	Дано Я открываю основную форму списка документа "ТСМ_ПлановаяПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПлановаяПотребностьВРесурсах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПлановаяПотребностьВРесурсах"

	Дано Я открываю основную форму документа "ТСМ_ПлановаяПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПлановаяПотребностьВРесурсах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПоступлениеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_ПоступлениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПоступлениеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПоступлениеТоплива"

	Дано Я открываю основную форму документа "ТСМ_ПоступлениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПоступлениеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПредоставлениеУслугИСервисов" 

	Дано Я открываю основную форму списка документа "ТСМ_ПредоставлениеУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПредоставлениеУслугИСервисов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПредоставлениеУслугИСервисов"

	Дано Я открываю основную форму документа "ТСМ_ПредоставлениеУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПредоставлениеУслугИСервисов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПриходТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ПриходТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПриходТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПриходТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ПриходТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПриходТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПутевойЛист" 

	Дано Я открываю основную форму списка документа "ТСМ_ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПутевойЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПутевойЛист"

	Дано Я открываю основную форму документа "ТСМ_ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПутевойЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РазнарядкаНаСмену" 

	Дано Я открываю основную форму списка документа "ТСМ_РазнарядкаНаСмену"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РазнарядкаНаСмену"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РазнарядкаНаСмену"

	Дано Я открываю основную форму документа "ТСМ_РазнарядкаНаСмену"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РазнарядкаНаСмену"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Рапорт" 

	Дано Я открываю основную форму списка документа "ТСМ_Рапорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Рапорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Рапорт"

	Дано Я открываю основную форму документа "ТСМ_Рапорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Рапорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РеализацияТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_РеализацияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеализацияТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РеализацияТоплива"

	Дано Я открываю основную форму документа "ТСМ_РеализацияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеализацияТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияВнеплановогоРейса" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияВнеплановогоРейса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияВнеплановогоРейса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияВнеплановогоРейса"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияВнеплановогоРейса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияВнеплановогоРейса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияПарковочныхМест" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияПарковочныхМест"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияТехникиЗаПарковочнымМестом" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РеестрПередачиДокументовВБухгалтерию" 

	Дано Я открываю основную форму списка документа "ТСМ_РеестрПередачиДокументовВБухгалтерию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеестрПередачиДокументовВБухгалтерию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РеестрПередачиДокументовВБухгалтерию"

	Дано Я открываю основную форму документа "ТСМ_РеестрПередачиДокументовВБухгалтерию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеестрПередачиДокументовВБухгалтерию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РесурсыЖУФВР" 

	Дано Я открываю основную форму списка документа "ТСМ_РесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РесурсыЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РесурсыЖУФВР"

	Дано Я открываю основную форму документа "ТСМ_РесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РесурсыЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Списание" 

	Дано Я открываю основную форму списка документа "ТСМ_Списание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Списание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Списание"

	Дано Я открываю основную форму документа "ТСМ_Списание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Списание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТоплива"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТопливаПоАкту" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТопливаПоАкту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТопливаПоАкту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТопливаПоАкту"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТопливаПоАкту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТопливаПоАкту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УстановкаЦенУслугВходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_УстановкаЦенУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугВходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УстановкаЦенУслугВходящих"

	Дано Я открываю основную форму документа "ТСМ_УстановкаЦенУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугВходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УстановкаЦенУслугИсходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_УстановкаЦенУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугИсходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УстановкаЦенУслугИсходящих"

	Дано Я открываю основную форму документа "ТСМ_УстановкаЦенУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугИсходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ШАБЛОН_ДОК" 

	Дано Я открываю основную форму списка документа "ТСМ_ШАБЛОН_ДОК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ШАБЛОН_ДОК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ШАБЛОН_ДОК"

	Дано Я открываю основную форму документа "ТСМ_ШАБЛОН_ДОК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ШАБЛОН_ДОК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий" 

	Дано Я открываю основную форму списка документа "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"

	Дано Я открываю основную форму документа "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПравДоступа"

	Дано Я открываю основную форму отчета "АнализПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПравДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПраваДоступа"

	Дано Я открываю основную форму отчета "ПраваДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПраваДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОбновленияОбластейДанных"

	Дано Я открываю основную форму отчета "ПрогрессОбновленияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОбновленияОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыПроверкиУчета"

	Дано Я открываю основную форму отчета "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыПроверкиУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_ОтчетОтладкаЗагрузки"

	Дано Я открываю основную форму отчета "ТСМ_RMQ_ОтчетОтладкаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_RMQ_ОтчетОтладкаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_АнализПотребностиВРесурсах"

	Дано Я открываю основную форму отчета "ТСМ_АнализПотребностиВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_АнализПотребностиВРесурсах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"

	Дано Я открываю основную форму отчета "ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВедомостьПоЗаправкамТопливаСоСклада"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВедомостьУчетаФактическогоРасходаИСписанияТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВладениеТехникойЭффективностьИспользования"

	Дано Я открываю основную форму отчета "ТСМ_ВладениеТехникойЭффективностьИспользования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВладениеТехникойЭффективностьИспользования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВремяВладенияТехникойПростоиЧасыПоЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыгрузкаSpiderМатериалы"

	Дано Я открываю основную форму отчета "ТСМ_ВыгрузкаSpiderМатериалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВыгрузкаSpiderМатериалы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыполненныеРаботыДляSpider"

	Дано Я открываю основную форму отчета "ТСМ_ВыполненныеРаботыДляSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ВыполненныеРаботыДляSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"

	Дано Я открываю основную форму отчета "ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ГрафикРаботыГенераторныхУстановокПоГлосав"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеЗаправокПоТопливнымКартам"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеЗаправокПоТопливнымКартам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеЗаправокПоТопливнымКартам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоАвариям"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоАвариям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоАвариям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоКоэффициентамМинтранса"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоКоэффициентамМинтранса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоКоэффициентамМинтранса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоНаработкеИРасходуТопливаДляТехОтдела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоНормамРасходаТопливаПоПриказуИОсновноеТопливо"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеПоПарковочнымМестам"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеПоПарковочнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеПоПарковочнымМестам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДанныеТранспондеров"

	Дано Я открываю основную форму отчета "ТСМ_ДанныеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДанныеТранспондеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ТСМ_ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЛегковойТехники"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЛегковойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЛегковойТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейЗаТехникой"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЭкипажейЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЭкипажейЗаТехникой"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗакреплениеЭкипажейЗаТехникойДляТехниковПоУчетуПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаПитание"

	Дано Я открываю основную форму отчета "ТСМ_ЗаявкаНаПитание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЗаявкаНаПитание"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_КарточкаРаботыТехники"

	Дано Я открываю основную форму отчета "ТСМ_КарточкаРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_КарточкаРаботыТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_КоэффициентВыходаНаЛинию"

	Дано Я открываю основную форму отчета "ТСМ_КоэффициентВыходаНаЛинию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_КоэффициентВыходаНаЛинию"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_МатериальныйОтчетКладовщикаПоТопливу"

	Дано Я открываю основную форму отчета "ТСМ_МатериальныйОтчетКладовщикаПоТопливу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_МатериальныйОтчетКладовщикаПоТопливу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"

	Дано Я открываю основную форму отчета "ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_МатериальныйОтчетКладовщикаПоТопливуПриходРасход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НаличиеТехникиНаТерриториях"

	Дано Я открываю основную форму отчета "ТСМ_НаличиеТехникиНаТерриториях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НаличиеТехникиНаТерриториях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НаработкаТехникиПоВодителямИМашинистам"

	Дано Я открываю основную форму отчета "ТСМ_НаработкаТехникиПоВодителямИМашинистам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НаработкаТехникиПоВодителямИМашинистам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_НезакрепленныеВодителиМашинисты"

	Дано Я открываю основную форму отчета "ТСМ_НезакрепленныеВодителиМашинисты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_НезакрепленныеВодителиМашинисты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОшибкиЗаполненияЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ОшибкиЗаполненияЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ОшибкиЗаполненияЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ОшибкиСвязанныеСРасчетомРасходаТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПережогиИАктыСписанияТоплива"

	Дано Я открываю основную форму отчета "ТСМ_ПережогиИАктыСписанияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПережогиИАктыСписанияТоплива"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПоАктамИОтветственным"

	Дано Я открываю основную форму отчета "ТСМ_ПоАктамИОтветственным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПоАктамИОтветственным"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПотребностьВРесурсах"

	Дано Я открываю основную форму отчета "ТСМ_ПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПотребностьВРесурсах"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПриказОЗакреплении"

	Дано Я открываю основную форму отчета "ТСМ_ПриказОЗакреплении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ПриказОЗакреплении"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РаботаТехникиПоЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_РаботаТехникиПоЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РаботаТехникиПоЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиДляБухгалтерии"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиДляБухгалтерии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиДляБухгалтерии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиНаОбъекте"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиНаОбъекте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиНаОбъекте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиПоПикетам"

	Дано Я открываю основную форму отчета "ТСМ_РасстановкаТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасстановкаТехникиПоПикетам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РасчетПотребностиПоПериодам"

	Дано Я открываю основную форму отчета "ТСМ_РасчетПотребностиПоПериодам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РасчетПотребностиПоПериодам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрАктовУслугПривлеченнаяТехника"

	Дано Я открываю основную форму отчета "ТСМ_РеестрАктовУслугПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрАктовУслугПривлеченнаяТехника"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПеревозокТехники"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПеревозокТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПеревозокТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПеревозокТехникиМеждуПикетами"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПеревозокТехникиМеждуПикетами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПеревозокТехникиМеждуПикетами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_РеестрПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"

	Дано Я открываю основную форму отчета "ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_РеестрУслугМашинМеханизмовВРАБОТЕ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СверкаСоСпайдер"

	Дано Я открываю основную форму отчета "ТСМ_СверкаСоСпайдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СверкаСоСпайдер"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"

	Дано Я открываю основную форму отчета "ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СводныйОтчетПоАктамПривлеченнойТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СправкаОВакансиях"

	Дано Я открываю основную форму отчета "ТСМ_СправкаОВакансиях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СправкаОВакансиях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"

	Дано Я открываю основную форму отчета "ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СравнениеРасходаТопливаПоНормеИПоФакту"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"

	Дано Я открываю основную форму отчета "ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СравнениеРасходаТопливаПоНормеИПоФактуВРазрезеПараметровНаработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СтатистикаИспользованияОтчетов"

	Дано Я открываю основную форму отчета "ТСМ_СтатистикаИспользованияОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СтатистикаИспользованияОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_СтатусыПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_СтатусыПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_СтатусыПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ТабельПоПутевойДокументации"

	Дано Я открываю основную форму отчета "ТСМ_ТабельПоПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ТабельПоПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ТехникаНеНайденаВЖУФВР"

	Дано Я открываю основную форму отчета "ТСМ_ТехникаНеНайденаВЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ТехникаНеНайденаВЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_УслугиОказываемыеФизическимЛицам"

	Дано Я открываю основную форму отчета "ТСМ_УслугиОказываемыеФизическимЛицам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_УслугиОказываемыеФизическимЛицам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ФактическиВыполненныеРаботыДляSpider"

	Дано Я открываю основную форму отчета "ТСМ_ФактическиВыполненныеРаботыДляSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ФактическиВыполненныеРаботыДляSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЭффективностьИспользованияРесурсов"

	Дано Я открываю основную форму отчета "ТСМ_ЭффективностьИспользованияРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЭффективностьИспользованияРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЭффективностьРесурсовЛюди6_2"

	Дано Я открываю основную форму отчета "ТСМ_ЭффективностьРесурсовЛюди6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТСМ_ЭффективностьРесурсовЛюди6_2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольОтчетов"

	Дано Я открываю основную форму отчета "УИ_КонсольОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УИ_КонсольОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_АнализПравДоступа"

	Дано Я открываю основную форму отчета "ИТК_АнализПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_АнализПравДоступа"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_МониторЛицензий"

	Дано Я открываю основную форму отчета "ИТК_МониторЛицензий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_МониторЛицензий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_СравнениеОбъектов"

	Дано Я открываю основную форму отчета "ИТК_СравнениеОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИТК_СравнениеОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхСверткаСсылокНаПользователейВРазделенныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"

	Дано Я открываю основную форму обработки "ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнструментыРазработчикаКонсольЗапросовПерехватОтчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонсольЗапросовУФ"

	Дано Я открываю основную форму обработки "КонсольЗапросовУФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонсольЗапросовУФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпИнтерактивнаяОстановкаМенеджеровПотоков"

	Дано Я открываю основную форму обработки "мпИнтерактивнаяОстановкаМенеджеровПотоков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпИнтерактивнаяОстановкаМенеджеровПотоков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъект"

	Дано Я открываю основную форму обработки "мпОбработатьОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектОшибкаПриОбработке"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектОшибкаПриОбработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектОшибкаПриОбработке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектПередачаЧастныхПараметров"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектПередачаЧастныхПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектПередачаЧастныхПараметров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектФайлыГрафаGephi"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектФайлыГрафаGephi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектФайлыГрафаGephi"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"

	Дано Я открываю основную форму обработки "мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработатьОбъектФайлыГрафаПроизвольнаяПрограмма"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииАвтосборка"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииАвтосборка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииАвтосборка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииАвтосборкаИПередачаОбщихПараметров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПроизвольнаяСборка"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПроизвольнаяСборка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПроизвольнаяСборка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПроизвольнаяСборкаВыводДоИПослеОбработки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "мпОбработкаКоллекцииПростая"

	Дано Я открываю основную форму обработки "мпОбработкаКоллекцииПростая"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки мпОбработкаКоллекцииПростая"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкаСтандартногоИнтерфейсаOData"

	Дано Я открываю основную форму обработки "НастройкаСтандартногоИнтерфейсаOData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаСтандартногоИнтерфейсаOData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбновлениеВспомогательныхДанных"

	Дано Я открываю основную форму обработки "ОбновлениеВспомогательныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеВспомогательныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Обработка1"

	Дано Я открываю основную форму обработки "Обработка1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Обработка1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОписаниеОбработчиковОбновления"

	Дано Я открываю основную форму обработки "ОписаниеОбработчиковОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОписаниеОбработчиковОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПанельАдминистрированияБСПВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСПВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСПВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПереносФайлов"

	Дано Я открываю основную форму обработки "ПереносФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДаннымиВМоделиСервиса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"

	Дано Я открываю основную форму обработки "ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникНастройкиСинхронизацииДанныхМеждуПриложениямиВИнтернете"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияАвтономногоРабочегоМеста"

	Дано Я открываю основную форму обработки "ПомощникСозданияАвтономногоРабочегоМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияАвтономногоРабочегоМеста"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТелеграмПолучениеОбновлений"

	Дано Я открываю основную форму обработки "ТелеграмПолучениеОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТелеграмПолучениеОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_ЗагрузкаСообщенияОбменаИзСтроки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_КонсольКода"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_КонсольКода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_КонсольКода"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_RMQ_КонсольУправления"

	Дано Я открываю основную форму обработки "ТСМ_RMQ_КонсольУправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_RMQ_КонсольУправления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_АРМДиспетчера"

	Дано Я открываю основную форму обработки "ТСМ_АРМДиспетчера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_АРМДиспетчера"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_БлокировкаПериодовЖУФВР"

	Дано Я открываю основную форму обработки "ТСМ_БлокировкаПериодовЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_БлокировкаПериодовЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ВыгрузкаВSpiderЗаПериод"

	Дано Я открываю основную форму обработки "ТСМ_ВыгрузкаВSpiderЗаПериод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ВыгрузкаВSpiderЗаПериод"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаДанныхНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаИзSpider"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаИзSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаИзSpider"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ИзменениеДатыЖУФВР"

	Дано Я открываю основную форму обработки "ТСМ_ИзменениеДатыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ИзменениеДатыЖУФВР"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"

	Дано Я открываю основную форму обработки "ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ИзменениеФактическогоОбъемаСтруктурыРабот"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"

	Дано Я открываю основную форму обработки "ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ОбработкаПроведенияВыборочноПоРегистрам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ОткрытьПолныйСписокТерриторий"

	Дано Я открываю основную форму обработки "ТСМ_ОткрытьПолныйСписокТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ОткрытьПолныйСписокТерриторий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьЖурналаПутевойДокументации"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьЖурналаПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьЖурналаПутевойДокументации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьНакладныхНаПеремещениеТопливаПриход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"

	Дано Я открываю основную форму обработки "ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПечатьНакладныхНаПеремещениеТопливаРасход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"

	Дано Я открываю основную форму обработки "ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ПомощникУстановкиЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_РеанимацияПодчиненногоУзла"

	Дано Я открываю основную форму обработки "ТСМ_РеанимацияПодчиненногоУзла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_РеанимацияПодчиненногоУзла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТСМ_ЗагрузкаСпайдерОтчеты"

	Дано Я открываю основную форму обработки "ТСМ_ЗагрузкаСпайдерОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТСМ_ЗагрузкаСпайдерОтчеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ГрупповаяОбработкаСправочниковИДокументов"

	Дано Я открываю основную форму обработки "УИ_ГрупповаяОбработкаСправочниковИДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ГрупповаяОбработкаСправочниковИДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторКонстант"

	Дано Я открываю основную форму обработки "УИ_РедакторКонстант"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторКонстант"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_СтруктураХраненияБазыДанных"

	Дано Я открываю основную форму обработки "УИ_СтруктураХраненияБазыДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_СтруктураХраненияБазыДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УИ_УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"

	Дано Я открываю основную форму обработки "УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ВыполнениеРегламентныхЗаданийНаКлиенте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольЗапросов"

	Дано Я открываю основную форму обработки "УИ_КонсольЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольЗапросов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольЗаданий"

	Дано Я открываю основную форму обработки "УИ_КонсольЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольЗаданий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "УИ_РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольКода"

	Дано Я открываю основную форму обработки "УИ_КонсольКода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольКода"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "УИ_ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПоискСсылокНаОбъект"

	Дано Я открываю основную форму обработки "УИ_ПоискСсылокНаОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПоискСсылокНаОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ТехПоддержка"

	Дано Я открываю основную форму обработки "УИ_ТехПоддержка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ТехПоддержка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторРеквизитовОбъекта"

	Дано Я открываю основную форму обработки "УИ_РедакторРеквизитовОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторРеквизитовОбъекта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ДинамическийСписок"

	Дано Я открываю основную форму обработки "УИ_ДинамическийСписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ДинамическийСписок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольHTTPЗапросов"

	Дано Я открываю основную форму обработки "УИ_КонсольHTTPЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольHTTPЗапросов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"

	Дано Я открываю основную форму обработки "УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ВыгрузкаЗагрузкаДанныхXMLСФильтрами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ПреобразованиеДанныхJSON"

	Дано Я открываю основную форму обработки "УИ_ПреобразованиеДанныхJSON"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ПреобразованиеДанныхJSON"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонструкторРегулярныхВыражений"

	Дано Я открываю основную форму обработки "УИ_КонструкторРегулярныхВыражений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонструкторРегулярныхВыражений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_НавигаторПоКонфигурации"

	Дано Я открываю основную форму обработки "УИ_НавигаторПоКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_НавигаторПоКонфигурации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ФайловыйМенеджер"

	Дано Я открываю основную форму обработки "УИ_ФайловыйМенеджер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ФайловыйМенеджер"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольСравненияДанных"

	Дано Я открываю основную форму обработки "УИ_КонсольСравненияДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольСравненияДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ИнформацияОЛицензиях1С"

	Дано Я открываю основную форму обработки "УИ_ИнформацияОЛицензиях1С"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ИнформацияОЛицензиях1С"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_КонсольВебСервисов"

	Дано Я открываю основную форму обработки "УИ_КонсольВебСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_КонсольВебСервисов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ЗагрузкаДанныхИзТабличногоДокумента"

	Дано Я открываю основную форму обработки "УИ_ЗагрузкаДанныхИзТабличногоДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ЗагрузкаДанныхИзТабличногоДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_ДанныеДляОтладки"

	Дано Я открываю основную форму обработки "УИ_ДанныеДляОтладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_ДанныеДляОтладки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_МенеджерХранилищНастроек"

	Дано Я открываю основную форму обработки "УИ_МенеджерХранилищНастроек"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_МенеджерХранилищНастроек"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторJSON"

	Дано Я открываю основную форму обработки "УИ_РедакторJSON"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторJSON"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторHTML"

	Дано Я открываю основную форму обработки "УИ_РедакторHTML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторHTML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УИ_УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_РедакторСКД"

	Дано Я открываю основную форму обработки "УИ_РедакторСКД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_РедакторСКД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УИ_СравнениеОбъектов"

	Дано Я открываю основную форму обработки "УИ_СравнениеОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УИ_СравнениеОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard10"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard10"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard10"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard11"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard11"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard11"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard12"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard12"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard12"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard13"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard13"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard13"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard14"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard14"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard14"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard15"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard15"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard15"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard16"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard16"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard16"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_QueryWizard1718192021"

	Дано Я открываю основную форму обработки "ИТК_QueryWizard1718192021"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_QueryWizard1718192021"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ВсеФункции"

	Дано Я открываю основную форму обработки "ИТК_ВсеФункции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ВсеФункции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ГлобальноеМеню"

	Дано Я открываю основную форму обработки "ИТК_ГлобальноеМеню"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ГлобальноеМеню"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ДинамическийСписок"

	Дано Я открываю основную форму обработки "ИТК_ДинамическийСписок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ДинамическийСписок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ИТК_ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонсольРазработчика"

	Дано Я открываю основную форму обработки "ИТК_КонсольРазработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонсольРазработчика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонструкторСКД"

	Дано Я открываю основную форму обработки "ИТК_КонструкторСКД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонструкторСКД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_КонструкторСтрокиОтладки"

	Дано Я открываю основную форму обработки "ИТК_КонструкторСтрокиОтладки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_КонструкторСтрокиОтладки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_Поддержка"

	Дано Я открываю основную форму обработки "ИТК_Поддержка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_Поддержка"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПодпискиНаСобытия"

	Дано Я открываю основную форму обработки "ИТК_ПодпискиНаСобытия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПодпискиНаСобытия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПоискИЗаменаСсылок"

	Дано Я открываю основную форму обработки "ИТК_ПоискИЗаменаСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПоискИЗаменаСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_ПоискСсылокНаОбъект"

	Дано Я открываю основную форму обработки "ИТК_ПоискСсылокНаОбъект"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_ПоискСсылокНаОбъект"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_Пользователи"

	Дано Я открываю основную форму обработки "ИТК_Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_Пользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "ИТК_РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторКонстант"

	Дано Я открываю основную форму обработки "ИТК_РедакторКонстант"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторКонстант"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторОбъекта"

	Дано Я открываю основную форму обработки "ИТК_РедакторОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторОбъекта"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИТК_РедакторПараметровСеанса"

	Дано Я открываю основную форму обработки "ИТК_РедакторПараметровСеанса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИТК_РедакторПараметровСеанса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АдресныеОбъекты"

	Дано Я открываю основную форму регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БуферОперацийСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БуферОперацийСтатистики"

	Дано Я открываю основную форму регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДампыПлатформы" 

	Дано Я открываю основную форму списка регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДампыПлатформы"

	Дано Я открываю основную форму регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеПроизводственногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДвоичныеДанныеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДвоичныеДанныеФайлов"

	Дано Я открываю основную форму регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДомаЗданияСтроения"

	Дано Я открываю основную форму регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗависимостиПравДоступа"

	Дано Я открываю основную форму регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗагруженныеВерсииАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыКомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыКомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗамерыСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамерыСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗемельныеУчастки" 

	Дано Я открываю основную форму списка регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗемельныеУчастки"

	Дано Я открываю основную форму регистра сведений "ЗемельныеУчастки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗемельныеУчастки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияЕМРЦ" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияЕМРЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЕМРЦ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияЕМРЦ"

	Дано Я открываю основную форму регистра сведений "ЗначенияЕМРЦ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияЕМРЦ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"

	Дано Я открываю основную форму регистра сведений "ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеДополнительныхОтчетовИОбработокСервисаВАвтономномРабочемМесте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"

	Дано Я открываю основную форму регистра сведений "ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендарныеГрафики" 

	Дано Я открываю основную форму списка регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендарныеГрафики"

	Дано Я открываю основную форму регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаВнешнихПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаВнешнихПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКОбъектам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКОбъектам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКОбъектам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКОбъектам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКРегистрам" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКРегистрам"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКРегистрам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегистрам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаКРегиструРезультатыПроверкиУчета" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаКРегиструРезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегиструРезультатыПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаКРегиструРезультатыПроверкиУчета"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаКРегиструРезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаКРегиструРезультатыПроверкиУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаНаборовГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаНаборовГруппДоступа"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаНаборовГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаНаборовГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючиДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючиДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "КлючиДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КлючиДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КодировкиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодировкиФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПереводов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПереводов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПереводов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПереводов"

	Дано Я открываю основную форму регистра сведений "КэшПереводов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПереводов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КэшПрограммныхИнтерфейсов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КэшПрограммныхИнтерфейсов"

	Дано Я открываю основную форму регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаличиеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаличиеФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменаДаннымиXDTO" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменаДаннымиXDTO"

	Дано Я открываю основную форму регистра сведений "НастройкиОбменаДаннымиXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОбменаДаннымиXDTO"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОчисткиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаДанными"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластейДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТранспортаОбменаОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТранспортаОбменаОбластиДанных"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбменаОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбменаОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеразделенныеПользователи" 

	Дано Я открываю основную форму списка регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеразделенныеПользователи"

	Дано Я открываю основную форму регистра сведений "НеразделенныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеразделенныеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НеудаленныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "НеудаленныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеудаленныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НеудаленныеОбъекты"

	Дано Я открываю основную форму регистра сведений "НеудаленныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НеудаленныеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаКДанным" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаКДанным"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаКДанным"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаКДанным"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбновлениеКлючейДоступаТекущиеЗадания" 

	Дано Я открываю основную форму списка регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбновлениеКлючейДоступаТекущиеЗадания"

	Дано Я открываю основную форму регистра сведений "ОбновлениеКлючейДоступаТекущиеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбновлениеКлючейДоступаТекущиеЗадания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОбновления" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОбновления"

	Дано Я открываю основную форму регистра сведений "ОбработчикиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиОбновленияОбщихДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиОбновленияОбщихДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновленияОбщихДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиОбновленияОбщихДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиОбновленияОбщихДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиОбновленияОбщихДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеПоставляемыеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ОбщиеПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОриентирыАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОриентирыАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтветыНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыДляОтправки" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыДляОтправки"

	Дано Я открываю основную форму регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетыИнформацииПриЗапуске"

	Дано Я открываю основную форму регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыОграниченияДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыОграниченияДоступа"

	Дано Я открываю основную форму регистра сведений "ПараметрыОграниченияДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыОграниченияДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРаботыПрограммы" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРаботыПрограммы"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПериодыНерабочихДнейКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ПериодыНерабочихДнейКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыНерабочихДнейКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПериодыНерабочихДнейКалендаря"

	Дано Я открываю основную форму регистра сведений "ПериодыНерабочихДнейКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПериодыНерабочихДнейКалендаря"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеМакетыПечати"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПотокиОбновления" 

	Дано Я открываю основную форму списка регистра сведений "ПотокиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотокиОбновления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПотокиОбновления"

	Дано Я открываю основную форму регистра сведений "ПотокиОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПотокиОбновления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПраваРолей"

	Дано Я открываю основную форму регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаДляОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаДляОбменаДанными"

	Дано Я открываю основную форму регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныИзмененияАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроцессыДляЗапуска" 

	Дано Я открываю основную форму списка регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПсевдонимыПредопределенныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПсевдонимыПредопределенныхУзлов"

	Дано Я открываю основную форму регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПубличныеИдентификаторыСинхронизируемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux" 

	Дано Я открываю основную форму списка регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РазрешенияНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулей" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РежимыПодключенияВнешнихМодулей"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезультатыПроверкиУчета" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезультатыПроверкиУчета"

	Дано Я открываю основную форму регистра сведений "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РучныеИзмененияГрафиковРаботы" 

	Дано Я открываю основную форму списка регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РучныеИзмененияГрафиковРаботы"

	Дано Я открываю основную форму регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОФайлах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОФайлах"

	Дано Я открываю основную форму регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СвязиАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СвязиАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "СвязиАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СвязиАдресныхОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыШифрования" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыШифрования"

	Дано Я открываю основную форму регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СессииОбменаСообщениямиСистемы" 

	Дано Я открываю основную форму списка регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СессииОбменаСообщениямиСистемы"

	Дано Я открываю основную форму регистра сведений "СессииОбменаСообщениямиСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СессииОбменаСообщениямиСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СлужебныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДанными"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбменаДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбменаДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияОригиналовПервичныхДокументов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияОригиналовПервичныхДокументов"

	Дано Я открываю основную форму регистра сведений "СостоянияОригиналовПервичныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОригиналовПервичныхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПапокПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияПроверокВеденияУчета" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПроверокВеденияУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПроверокВеденияУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияПроверокВеденияУчета"

	Дано Я открываю основную форму регистра сведений "СостоянияПроверокВеденияУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПроверокВеденияУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДаннымиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияУспешныхОбменовДаннымиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДаннымиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДаннымиОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатистикаКонфигурации" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатистикаКонфигурации"

	Дано Я открываю основную форму регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СубъектыДляСкрытияПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СубъектыДляСкрытияПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СубъектыДляСкрытияПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СубъектыДляСкрытияПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмЖурнал" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмЖурнал"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЖурнал"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмЖурнал"

	Дано Я открываю основную форму регистра сведений "ТелеграмЖурнал"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЖурнал"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмЗначенияПараметров" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмЗначенияПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЗначенияПараметров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмЗначенияПараметров"

	Дано Я открываю основную форму регистра сведений "ТелеграмЗначенияПараметров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЗначенияПараметров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмИдентификаторыФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмИдентификаторыФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИдентификаторыФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмИдентификаторыФайлов"

	Дано Я открываю основную форму регистра сведений "ТелеграмИдентификаторыФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИдентификаторыФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмИзбранныеМетоды" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмИзбранныеМетоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИзбранныеМетоды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмИзбранныеМетоды"

	Дано Я открываю основную форму регистра сведений "ТелеграмИзбранныеМетоды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИзбранныеМетоды"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмИзбранныеФрагменты" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмИзбранныеФрагменты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИзбранныеФрагменты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмИзбранныеФрагменты"

	Дано Я открываю основную форму регистра сведений "ТелеграмИзбранныеФрагменты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмИзбранныеФрагменты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмСмещение" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмСмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмСмещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмСмещение"

	Дано Я открываю основную форму регистра сведений "ТелеграмСмещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмСмещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмСтатистика" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмСтатистика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмСтатистика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмСтатистика"

	Дано Я открываю основную форму регистра сведений "ТелеграмСтатистика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмСтатистика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмТаймеры" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмТаймеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмТаймеры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмТаймеры"

	Дано Я открываю основную форму регистра сведений "ТелеграмТаймеры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмТаймеры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелеграмЭмодзи" 

	Дано Я открываю основную форму списка регистра сведений "ТелеграмЭмодзи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЭмодзи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелеграмЭмодзи"

	Дано Я открываю основную форму регистра сведений "ТелеграмЭмодзи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТелеграмЭмодзи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ЗагруженныеСообщения" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_ЗагруженныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ЗагруженныеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ЗагруженныеСообщения"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_ЗагруженныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ЗагруженныеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ЗарегистрированныеОбъектыДляОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОбъектыДляВыгрузкиИзИсточника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ОтправленныеСообщения" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_ОтправленныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОтправленныеСообщения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ОтправленныеСообщения"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_ОтправленныеСообщения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОтправленныеСообщения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_ОчередьСообщенийДляЗагрузки" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_ОчередьСообщенийДляЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОчередьСообщенийДляЗагрузки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_ОчередьСообщенийДляЗагрузки"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_ОчередьСообщенийДляЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_ОчередьСообщенийДляЗагрузки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_RMQ_СоответствиеОбъектовИБ" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_RMQ_СоответствиеОбъектовИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_СоответствиеОбъектовИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_RMQ_СоответствиеОбъектовИБ"

	Дано Я открываю основную форму регистра сведений "ТСМ_RMQ_СоответствиеОбъектовИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_RMQ_СоответствиеОбъектовИБ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктуальнаяВерсияЖУФВР" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_АктуальнаяВерсияЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_АктуальнаяВерсияЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктуальнаяВерсияЖУФВР"

	Дано Я открываю основную форму регистра сведений "ТСМ_АктуальнаяВерсияЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_АктуальнаяВерсияЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВидыРаботСМИАТ_SPIDER" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ВидыРаботСМИАТ_SPIDER"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВидыРаботСМИАТ_SPIDER"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВидыРаботСМИАТ_SPIDER"

	Дано Я открываю основную форму регистра сведений "ТСМ_ВидыРаботСМИАТ_SPIDER"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВидыРаботСМИАТ_SPIDER"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВладельцыИндентификационныхУстройств" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ВладельцыИндентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВладельцыИндентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВладельцыИндентификационныхУстройств"

	Дано Я открываю основную форму регистра сведений "ТСМ_ВладельцыИндентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВладельцыИндентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВремяРаботыПользователяСДокументом" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ВремяРаботыПользователяСДокументом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВремяРаботыПользователяСДокументом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВремяРаботыПользователяСДокументом"

	Дано Я открываю основную форму регистра сведений "ТСМ_ВремяРаботыПользователяСДокументом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВремяРаботыПользователяСДокументом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыданныеПропускаПарковочныхМест" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ВыданныеПропускаПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВыданныеПропускаПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыданныеПропускаПарковочныхМест"

	Дано Я открываю основную форму регистра сведений "ТСМ_ВыданныеПропускаПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВыданныеПропускаПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыработкаСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ВыработкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВыработкаСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыработкаСотрудников"

	Дано Я открываю основную форму регистра сведений "ТСМ_ВыработкаСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ВыработкаСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГосНомераТранспортныхСредств" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ГосНомераТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГосНомераТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГосНомераТранспортныхСредств"

	Дано Я открываю основную форму регистра сведений "ТСМ_ГосНомераТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГосНомераТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГрафикиРаботы" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГрафикиРаботы"

	Дано Я открываю основную форму регистра сведений "ТСМ_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГрафикиРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ГрафикиРаботыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ГрафикиРаботыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГрафикиРаботыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ГрафикиРаботыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ТСМ_ГрафикиРаботыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ГрафикиРаботыФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДанныеИзDirectum" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ДанныеИзDirectum"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДанныеИзDirectum"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДанныеИзDirectum"

	Дано Я открываю основную форму регистра сведений "ТСМ_ДанныеИзDirectum"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДанныеИзDirectum"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДанныеСчетчиковТехники" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ДанныеСчетчиковТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДанныеСчетчиковТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДанныеСчетчиковТехники"

	Дано Я открываю основную форму регистра сведений "ТСМ_ДанныеСчетчиковТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДанныеСчетчиковТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДвижениеОригиналовДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ДвижениеОригиналовДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДвижениеОригиналовДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДвижениеОригиналовДокументов"

	Дано Я открываю основную форму регистра сведений "ТСМ_ДвижениеОригиналовДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДвижениеОригиналовДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДоговораКонтрагентов" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ДоговораКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДоговораКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДоговораКонтрагентов"

	Дано Я открываю основную форму регистра сведений "ТСМ_ДоговораКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДоговораКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДоступныеДолжностиЖУФВР" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ДоступныеДолжностиЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДоступныеДолжностиЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДоступныеДолжностиЖУФВР"

	Дано Я открываю основную форму регистра сведений "ТСМ_ДоступныеДолжностиЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ДоступныеДолжностиЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЗакреплениеПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкиНаТехникуВнутренние" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЗаявкиНаТехникуВнутренние"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЗаявкиНаТехникуВнутренние"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкиНаТехникуВнутренние"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЗаявкиНаТехникуВнутренние"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЗаявкиНаТехникуВнутренние"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ИнформацияПоСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ИнформацияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ИнформацияПоСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ИнформацияПоСотрудникам"

	Дано Я открываю основную форму регистра сведений "ТСМ_ИнформацияПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ИнформацияПоСотрудникам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КадроваяИсторияФизлица" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_КадроваяИсторияФизлица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_КадроваяИсторияФизлица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КадроваяИсторияФизлица"

	Дано Я открываю основную форму регистра сведений "ТСМ_КадроваяИсторияФизлица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_КадроваяИсторияФизлица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЛинейнаяНормаРасходаТоплива" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЛинейнаяНормаРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЛинейнаяНормаРасходаТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЛинейнаяНормаРасходаТоплива"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЛинейнаяНормаРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЛинейнаяНормаРасходаТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_МестоДислокацииФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_МестоДислокацииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_МестоДислокацииФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_МестоДислокацииФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "ТСМ_МестоДислокацииФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_МестоДислокацииФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_МинимальныйОстатокТопливаВБакеТехники" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_МинимальныйОстатокТопливаВБакеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_МинимальныйОстатокТопливаВБакеТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_МинимальныйОстатокТопливаВБакеТехники"

	Дано Я открываю основную форму регистра сведений "ТСМ_МинимальныйОстатокТопливаВБакеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_МинимальныйОстатокТопливаВБакеТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НазначениеТехникиПоЗаявкам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НазначениеТехникиПоЗаявкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначениеТехникиПоЗаявкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НазначениеТехникиПоЗаявкам"

	Дано Я открываю основную форму регистра сведений "ТСМ_НазначениеТехникиПоЗаявкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначениеТехникиПоЗаявкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НазначенияСчитывателей" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НазначенияСчитывателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначенияСчитывателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НазначенияСчитывателей"

	Дано Я открываю основную форму регистра сведений "ТСМ_НазначенияСчитывателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначенияСчитывателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НазначенныеУслуги" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НазначенныеУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначенныеУслуги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НазначенныеУслуги"

	Дано Я открываю основную форму регистра сведений "ТСМ_НазначенныеУслуги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НазначенныеУслуги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НастройкиПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НастройкиПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НастройкиПользователей"

	Дано Я открываю основную форму регистра сведений "ТСМ_НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НастройкиПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НастройкиПравДоступаПользователей" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НастройкиПравДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НастройкиПравДоступаПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НастройкиПравДоступаПользователей"

	Дано Я открываю основную форму регистра сведений "ТСМ_НастройкиПравДоступаПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НастройкиПравДоступаПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НормативЧисленностиОдногоЭкипажа" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НормативЧисленностиОдногоЭкипажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормативЧисленностиОдногоЭкипажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НормативЧисленностиОдногоЭкипажа"

	Дано Я открываю основную форму регистра сведений "ТСМ_НормативЧисленностиОдногоЭкипажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормативЧисленностиОдногоЭкипажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НормыПроизводительностиЖУФВР" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НормыПроизводительностиЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормыПроизводительностиЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НормыПроизводительностиЖУФВР"

	Дано Я открываю основную форму регистра сведений "ТСМ_НормыПроизводительностиЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормыПроизводительностиЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НормыРасходаТоплива" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_НормыРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормыРасходаТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НормыРасходаТоплива"

	Дано Я открываю основную форму регистра сведений "ТСМ_НормыРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_НормыРасходаТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОтветственныеЗаПодписаниеДокументов" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ОтветственныеЗаПодписаниеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтветственныеЗаПодписаниеДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОтветственныеЗаПодписаниеДокументов"

	Дано Я открываю основную форму регистра сведений "ТСМ_ОтветственныеЗаПодписаниеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтветственныеЗаПодписаниеДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОтказыНазначенияТехникиПоЗаявкам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ОтказыНазначенияТехникиПоЗаявкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтказыНазначенияТехникиПоЗаявкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОтказыНазначенияТехникиПоЗаявкам"

	Дано Я открываю основную форму регистра сведений "ТСМ_ОтказыНазначенияТехникиПоЗаявкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтказыНазначенияТехникиПоЗаявкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОтметкиДиспетчераПоТехникеОбъекта" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ОтметкиДиспетчераПоТехникеОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтметкиДиспетчераПоТехникеОбъекта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОтметкиДиспетчераПоТехникеОбъекта"

	Дано Я открываю основную форму регистра сведений "ТСМ_ОтметкиДиспетчераПоТехникеОбъекта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтметкиДиспетчераПоТехникеОбъекта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОтслеживаемыеВАктахТипыСпайдер" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ОтслеживаемыеВАктахТипыСпайдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтслеживаемыеВАктахТипыСпайдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОтслеживаемыеВАктахТипыСпайдер"

	Дано Я открываю основную форму регистра сведений "ТСМ_ОтслеживаемыеВАктахТипыСпайдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ОтслеживаемыеВАктахТипыСпайдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПарковочныеМеста" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПарковочныеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПарковочныеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПарковочныеМеста"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПарковочныеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПарковочныеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПерсонализацияТехники" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПерсонализацияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПерсонализацияТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПерсонализацияТехники"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПерсонализацияТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПерсонализацияТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПлановыеДанныеПоЗаявкамНаПредоставлениюУслуг"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПользователиДиспетчерскихЦентров" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПользователиДиспетчерскихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПользователиДиспетчерскихЦентров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПользователиДиспетчерскихЦентров"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПользователиДиспетчерскихЦентров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПользователиДиспетчерскихЦентров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПотребностьВРесурсах" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПотребностьВРесурсах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПотребностьВРесурсах"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПотребностьВРесурсах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПривлеченнаяТехникаДляУчетаСписанияЗатратПоТопливу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РасстановкаТехникиПоПарковочнымМестам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_РасстановкаТехникиПоПарковочнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_РасстановкаТехникиПоПарковочнымМестам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РасстановкаТехникиПоПарковочнымМестам"

	Дано Я открываю основную форму регистра сведений "ТСМ_РасстановкаТехникиПоПарковочнымМестам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_РасстановкаТехникиПоПарковочнымМестам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РежимРаботыТехники" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_РежимРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_РежимРаботыТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РежимРаботыТехники"

	Дано Я открываю основную форму регистра сведений "ТСМ_РежимРаботыТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_РежимРаботыТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ"

	Дано Я открываю основную форму регистра сведений "ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеСкладаВидаСкладТопливаСкладамВидаСкладАТиДСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СоответствиеТопливаТопливуВБаках" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СоответствиеТопливаТопливуВБаках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеТопливаТопливуВБаках"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СоответствиеТопливаТопливуВБаках"

	Дано Я открываю основную форму регистра сведений "ТСМ_СоответствиеТопливаТопливуВБаках"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеТопливаТопливуВБаках"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СоответствиеХозСпособаОбъектуСтроительства" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СоответствиеХозСпособаОбъектуСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеХозСпособаОбъектуСтроительства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СоответствиеХозСпособаОбъектуСтроительства"

	Дано Я открываю основную форму регистра сведений "ТСМ_СоответствиеХозСпособаОбъектуСтроительства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СоответствиеХозСпособаОбъектуСтроительства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписокОтветственныхЛицЗаВыезд" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СписокОтветственныхЛицЗаВыезд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СписокОтветственныхЛицЗаВыезд"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписокОтветственныхЛицЗаВыезд"

	Дано Я открываю основную форму регистра сведений "ТСМ_СписокОтветственныхЛицЗаВыезд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СписокОтветственныхЛицЗаВыезд"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатистикаИспользованияОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СтатистикаИспользованияОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатистикаИспользованияОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатистикаИспользованияОтчетов"

	Дано Я открываю основную форму регистра сведений "ТСМ_СтатистикаИспользованияОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатистикаИспользованияОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатусыИдентификационныхУстройств" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СтатусыИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатусыИдентификационныхУстройств"

	Дано Я открываю основную форму регистра сведений "ТСМ_СтатусыИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатусыТехникиПоСменам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СтатусыТехникиПоСменам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыТехникиПоСменам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатусыТехникиПоСменам"

	Дано Я открываю основную форму регистра сведений "ТСМ_СтатусыТехникиПоСменам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыТехникиПоСменам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СтатусыТранспондеров" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_СтатусыТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СтатусыТранспондеров"

	Дано Я открываю основную форму регистра сведений "ТСМ_СтатусыТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_СтатусыТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТерриторииСкладовВидаТопливоАТиДСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаВЭксплуатации" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаВЭксплуатации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаВЭксплуатации"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаВЭксплуатации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаВЭксплуатации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаНеНайденаВЖУФВР" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаНеНайденаВЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаНеНайденаВЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаНеНайденаВЖУФВР"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаНеНайденаВЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаНеНайденаВЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаПоПикетам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоПикетам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаПоПикетам"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоПикетам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаПоТерриториям" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаПоТерриториям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоТерриториям"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаПоТерриториям"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаПоТерриториям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоТерриториям"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаПоТерриториямФакт" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаПоТерриториямФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоТерриториямФакт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаПоТерриториямФакт"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаПоТерриториямФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаПоТерриториямФакт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТехникаСДопТопливнымиБаками" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ТехникаСДопТопливнымиБаками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаСДопТопливнымиБаками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТехникаСДопТопливнымиБаками"

	Дано Я открываю основную форму регистра сведений "ТСМ_ТехникаСДопТопливнымиБаками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ТехникаСДопТопливнымиБаками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УчетТранспондеров" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_УчетТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_УчетТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УчетТранспондеров"

	Дано Я открываю основную форму регистра сведений "ТСМ_УчетТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_УчетТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ФактическиеДанныеПоРейсам" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ФактическиеДанныеПоРейсам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ФактическиеДанныеПоРейсам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ФактическиеДанныеПоРейсам"

	Дано Я открываю основную форму регистра сведений "ТСМ_ФактическиеДанныеПоРейсам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ФактическиеДанныеПоРейсам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЦеныПредметовДоговоров" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЦеныПредметовДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныПредметовДоговоров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЦеныПредметовДоговоров"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЦеныПредметовДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныПредметовДоговоров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЦеныУслугВходящих" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЦеныУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныУслугВходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЦеныУслугВходящих"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЦеныУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныУслугВходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЦеныУслугИсходящих" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЦеныУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныУслугИсходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЦеныУслугИсходящих"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЦеныУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЦеныУслугИсходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЭкипажТехники" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЭкипажТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЭкипажТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЭкипажТехники"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЭкипажТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЭкипажТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЭксплуатационнаяНормаРасходаТоплива" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ЭксплуатационнаяНормаРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЭксплуатационнаяНормаРасходаТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЭксплуатационнаяНормаРасходаТоплива"

	Дано Я открываю основную форму регистра сведений "ТСМ_ЭксплуатационнаяНормаРасходаТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ЭксплуатационнаяНормаРасходаТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени3" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗамерыВремени3"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНастройкиТранспортаОбмена" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНастройкиТранспортаОбмена"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиТранспортаОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "УдалитьРезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРезультатыОбменаДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьТСМ_УчетФактическихРейсовТехники" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьТСМ_УчетФактическихРейсовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТСМ_УчетФактическихРейсовТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьТСМ_УчетФактическихРейсовТехники"

	Дано Я открываю основную форму регистра сведений "УдалитьТСМ_УчетФактическихРейсовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьТСМ_УчетФактическихРейсовТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдаляемыеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "УдаляемыеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдаляемыеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдаляемыеОбъекты"

	Дано Я открываю основную форму регистра сведений "УдаляемыеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдаляемыеОбъекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УровниСокращенийАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПодписи" 

	Дано Я открываю основную форму списка регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныеПодписи"

	Дано Я открываю основную форму регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КоэффициентыЗапасаРесурсов_год" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_КоэффициентыЗапасаРесурсов_год"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_КоэффициентыЗапасаРесурсов_год"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КоэффициентыЗапасаРесурсов_год"

	Дано Я открываю основную форму регистра сведений "ТСМ_КоэффициентыЗапасаРесурсов_год"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_КоэффициентыЗапасаРесурсов_год"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ФОТрабочих" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ФОТрабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ФОТрабочих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ФОТрабочих"

	Дано Я открываю основную форму регистра сведений "ТСМ_ФОТрабочих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ФОТрабочих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПлановыеДанныеПоРесурсамSpider" 

	Дано Я открываю основную форму списка регистра сведений "ТСМ_ПлановыеДанныеПоРесурсамSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПлановыеДанныеПоРесурсамSpider"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПлановыеДанныеПоРесурсамSpider"

	Дано Я открываю основную форму регистра сведений "ТСМ_ПлановыеДанныеПоРесурсамSpider"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТСМ_ПлановыеДанныеПоРесурсамSpider"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"

	Дано Я открываю основную форму регистра накопления "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыполненныеРаботыЖУФВР" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ВыполненныеРаботыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ВыполненныеРаботыЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыполненныеРаботыЖУФВР"

	Дано Я открываю основную форму регистра накопления "ТСМ_ВыполненныеРаботыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ВыполненныеРаботыЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ДвиженияТоплива" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ДвиженияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ДвиженияТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ДвиженияТоплива"

	Дано Я открываю основную форму регистра накопления "ТСМ_ДвиженияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ДвиженияТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ"

	Дано Я открываю основную форму регистра накопления "ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗаправкиТехникиПоДаннымСлужбыГСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаправкиТехникиПоПутевойДокументации" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ЗаправкиТехникиПоПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗаправкиТехникиПоПутевойДокументации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаправкиТехникиПоПутевойДокументации"

	Дано Я открываю основную форму регистра накопления "ТСМ_ЗаправкиТехникиПоПутевойДокументации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗаправкиТехникиПоПутевойДокументации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗатратыРесурсовЖУФВР" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ЗатратыРесурсовЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗатратыРесурсовЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗатратыРесурсовЖУФВР"

	Дано Я открываю основную форму регистра накопления "ТСМ_ЗатратыРесурсовЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ЗатратыРесурсовЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НаработкаТехникиИНормативныйРасходТоплива" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_НаработкаТехникиИНормативныйРасходТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_НаработкаТехникиИНормативныйРасходТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НаработкаТехникиИНормативныйРасходТоплива"

	Дано Я открываю основную форму регистра накопления "ТСМ_НаработкаТехникиИНормативныйРасходТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_НаработкаТехникиИНормативныйРасходТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_НормативнаяТрудоемкостьВыполненныхРабот" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_НормативнаяТрудоемкостьВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_НормативнаяТрудоемкостьВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_НормативнаяТрудоемкостьВыполненныхРабот"

	Дано Я открываю основную форму регистра накопления "ТСМ_НормативнаяТрудоемкостьВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_НормативнаяТрудоемкостьВыполненныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ОстаткиИдентификационныхУстройств" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ОстаткиИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ОстаткиИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ОстаткиИдентификационныхУстройств"

	Дано Я открываю основную форму регистра накопления "ТСМ_ОстаткиИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ОстаткиИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ТопливоНаСкладах" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_ТопливоНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ТопливоНаСкладах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ТопливоНаСкладах"

	Дано Я открываю основную форму регистра накопления "ТСМ_ТопливоНаСкладах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_ТопливоНаСкладах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УслугиКонтрагентовПривлеченнаяТехника" 

	Дано Я открываю основную форму списка регистра накопления "ТСМ_УслугиКонтрагентовПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_УслугиКонтрагентовПривлеченнаяТехника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УслугиКонтрагентовПривлеченнаяТехника"

	Дано Я открываю основную форму регистра накопления "ТСМ_УслугиКонтрагентовПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТСМ_УслугиКонтрагентовПривлеченнаяТехника"
	И Я закрываю текущее окно