#language: ru

@tree
@БыстрыеПроверки

Функционал: Функциональность открытия форм документов

Функциональность: Дымовые тесты

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Авария" 

	Дано Я открываю основную форму списка документа "ТСМ_Авария"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Авария"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Авария"

	Дано Я открываю основную форму документа "ТСМ_Авария"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Авария"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктОСбоеСчетчика" 

	Дано Я открываю основную форму списка документа "ТСМ_АктОСбоеСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктОСбоеСчетчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктОСбоеСчетчика"

	Дано Я открываю основную форму документа "ТСМ_АктОСбоеСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктОСбоеСчетчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктУслугиПривлеченнаяТехника" 

	Дано Я открываю основную форму списка документа "ТСМ_АктУслугиПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУслугиПривлеченнаяТехника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктУслугиПривлеченнаяТехника"

	Дано Я открываю основную форму документа "ТСМ_АктУслугиПривлеченнаяТехника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУслугиПривлеченнаяТехника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АктУстановкиНормМаршрутовТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_АктУстановкиНормМаршрутовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУстановкиНормМаршрутовТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АктУстановкиНормМаршрутовТехники"

	Дано Я открываю основную форму документа "ТСМ_АктУстановкиНормМаршрутовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АктУстановкиНормМаршрутовТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АннулированиеУслугВходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_АннулированиеУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугВходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АннулированиеУслугВходящих"

	Дано Я открываю основную форму документа "ТСМ_АннулированиеУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугВходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_АннулированиеУслугИсходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_АннулированиеУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугИсходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_АннулированиеУслугИсходящих"

	Дано Я открываю основную форму документа "ТСМ_АннулированиеУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_АннулированиеУслугИсходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией" 

	Дано Я открываю основную форму списка документа "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"

	Дано Я открываю основную форму документа "ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВводНачальныхДанныхПоЗакреплениюТехникиЗаТерриторией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВозвратИдентификационныхУстройств" 

	Дано Я открываю основную форму списка документа "ТСМ_ВозвратИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВозвратИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВозвратИдентификационныхУстройств"

	Дано Я открываю основную форму документа "ТСМ_ВозвратИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВозвратИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике" 

	Дано Я открываю основную форму списка документа "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"

	Дано Я открываю основную форму документа "ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВремяРаботыПоНавигацииПоПривлеченнойТехнике"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыбытиеТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_ВыбытиеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыбытиеТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыбытиеТехники"

	Дано Я открываю основную форму документа "ТСМ_ВыбытиеТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыбытиеТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ВыдачаИдентификационныхУстройств" 

	Дано Я открываю основную форму списка документа "ТСМ_ВыдачаИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыдачаИдентификационныхУстройств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ВыдачаИдентификационныхУстройств"

	Дано Я открываю основную форму документа "ТСМ_ВыдачаИдентификационныхУстройств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ВыдачаИдентификационныхУстройств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"

	Дано Я открываю основную форму документа "ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖурналУчетаЕжесменныхСтатусовТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЖУФВР" 

	Дано Я открываю основную форму списка документа "ТСМ_ЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЖУФВР"

	Дано Я открываю основную форму документа "ТСМ_ЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеПривлеченнойТехникиЗаТерриторией"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеТехникиПоПикетам" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоПикетам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеТехникиПоПикетам"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеТехникиПоПикетам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоПикетам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеТехникиПоТерриториямКолоннами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"

	Дано Я открываю основную форму документа "ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗакреплениеЭкипажейПрицеповМеханизмовЗаТехникой"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаправкаТехникиТопливом" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаправкаТехникиТопливом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаправкаТехникиТопливом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаправкаТехникиТопливом"

	Дано Я открываю основную форму документа "ТСМ_ЗаправкаТехникиТопливом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаправкаТехникиТопливом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаВыдачуТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаВыдачуТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаВыдачуТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаВыдачуТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаВыдачуТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаВыдачуТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаЗаселениеСтороннихСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ЗаявкаНаТехникуВнутренняя" 

	Дано Я открываю основную форму списка документа "ТСМ_ЗаявкаНаТехникуВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаТехникуВнутренняя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ЗаявкаНаТехникуВнутренняя"

	Дано Я открываю основную форму документа "ТСМ_ЗаявкаНаТехникуВнутренняя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ЗаявкаНаТехникуВнутренняя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "ТСМ_КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КорректировкаРегистров"

	Дано Я открываю основную форму документа "ТСМ_КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_КорректировкаУслугИСервисов" 

	Дано Я открываю основную форму списка документа "ТСМ_КорректировкаУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаУслугИСервисов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_КорректировкаУслугИСервисов"

	Дано Я открываю основную форму документа "ТСМ_КорректировкаУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_КорректировкаУслугИСервисов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Оприходование" 

	Дано Я открываю основную форму списка документа "ТСМ_Оприходование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Оприходование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Оприходование"

	Дано Я открываю основную форму документа "ТСМ_Оприходование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Оприходование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПередачаТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ПередачаТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередачаТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПередачаТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ПередачаТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередачаТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПередислокацияТехникиФакт" 

	Дано Я открываю основную форму списка документа "ТСМ_ПередислокацияТехникиФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередислокацияТехникиФакт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПередислокацияТехникиФакт"

	Дано Я открываю основную форму документа "ТСМ_ПередислокацияТехникиФакт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПередислокацияТехникиФакт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Перемещение" 

	Дано Я открываю основную форму списка документа "ТСМ_Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Перемещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Перемещение"

	Дано Я открываю основную форму документа "ТСМ_Перемещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Перемещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПеремещениеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_ПеремещениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПеремещениеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПеремещениеТоплива"

	Дано Я открываю основную форму документа "ТСМ_ПеремещениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПеремещениеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПлановаяПотребностьВРесурсах" 

	Дано Я открываю основную форму списка документа "ТСМ_ПлановаяПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПлановаяПотребностьВРесурсах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПлановаяПотребностьВРесурсах"

	Дано Я открываю основную форму документа "ТСМ_ПлановаяПотребностьВРесурсах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПлановаяПотребностьВРесурсах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПоступлениеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_ПоступлениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПоступлениеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПоступлениеТоплива"

	Дано Я открываю основную форму документа "ТСМ_ПоступлениеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПоступлениеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПредоставлениеУслугИСервисов" 

	Дано Я открываю основную форму списка документа "ТСМ_ПредоставлениеУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПредоставлениеУслугИСервисов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПредоставлениеУслугИСервисов"

	Дано Я открываю основную форму документа "ТСМ_ПредоставлениеУслугИСервисов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПредоставлениеУслугИСервисов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПриходТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_ПриходТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПриходТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПриходТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_ПриходТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПриходТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ПутевойЛист" 

	Дано Я открываю основную форму списка документа "ТСМ_ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПутевойЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ПутевойЛист"

	Дано Я открываю основную форму документа "ТСМ_ПутевойЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ПутевойЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РазнарядкаНаСмену" 

	Дано Я открываю основную форму списка документа "ТСМ_РазнарядкаНаСмену"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РазнарядкаНаСмену"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РазнарядкаНаСмену"

	Дано Я открываю основную форму документа "ТСМ_РазнарядкаНаСмену"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РазнарядкаНаСмену"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Рапорт" 

	Дано Я открываю основную форму списка документа "ТСМ_Рапорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Рапорт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Рапорт"

	Дано Я открываю основную форму документа "ТСМ_Рапорт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Рапорт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РеализацияТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_РеализацияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеализацияТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РеализацияТоплива"

	Дано Я открываю основную форму документа "ТСМ_РеализацияТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеализацияТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияВнеплановогоРейса" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияВнеплановогоРейса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияВнеплановогоРейса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияВнеплановогоРейса"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияВнеплановогоРейса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияВнеплановогоРейса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияНаработкиИДвиженийТопливаПривлеченнойТехники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияПарковочныхМест" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияПарковочныхМест"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияПарковочныхМест"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияПарковочныхМест"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияПарковочныхМест"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РегистрацияТехникиЗаПарковочнымМестом" 

	Дано Я открываю основную форму списка документа "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"

	Дано Я открываю основную форму документа "ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РегистрацияТехникиЗаПарковочнымМестом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РеестрПередачиДокументовВБухгалтерию" 

	Дано Я открываю основную форму списка документа "ТСМ_РеестрПередачиДокументовВБухгалтерию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеестрПередачиДокументовВБухгалтерию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РеестрПередачиДокументовВБухгалтерию"

	Дано Я открываю основную форму документа "ТСМ_РеестрПередачиДокументовВБухгалтерию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РеестрПередачиДокументовВБухгалтерию"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_РесурсыЖУФВР" 

	Дано Я открываю основную форму списка документа "ТСМ_РесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РесурсыЖУФВР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_РесурсыЖУФВР"

	Дано Я открываю основную форму документа "ТСМ_РесурсыЖУФВР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_РесурсыЖУФВР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_Списание" 

	Дано Я открываю основную форму списка документа "ТСМ_Списание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Списание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_Списание"

	Дано Я открываю основную форму документа "ТСМ_Списание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_Списание"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТоплива" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТоплива"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТоплива"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТоплива"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТоплива"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТопливаПоАкту" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТопливаПоАкту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТопливаПоАкту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТопливаПоАкту"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТопливаПоАкту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТопливаПоАкту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_СписаниеТранспондеров" 

	Дано Я открываю основную форму списка документа "ТСМ_СписаниеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТранспондеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_СписаниеТранспондеров"

	Дано Я открываю основную форму документа "ТСМ_СписаниеТранспондеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_СписаниеТранспондеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УстановкаЦенУслугВходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_УстановкаЦенУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугВходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УстановкаЦенУслугВходящих"

	Дано Я открываю основную форму документа "ТСМ_УстановкаЦенУслугВходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугВходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_УстановкаЦенУслугИсходящих" 

	Дано Я открываю основную форму списка документа "ТСМ_УстановкаЦенУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугИсходящих"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_УстановкаЦенУслугИсходящих"

	Дано Я открываю основную форму документа "ТСМ_УстановкаЦенУслугИсходящих"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_УстановкаЦенУслугИсходящих"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ШАБЛОН_ДОК" 

	Дано Я открываю основную форму списка документа "ТСМ_ШАБЛОН_ДОК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ШАБЛОН_ДОК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ШАБЛОН_ДОК"

	Дано Я открываю основную форму документа "ТСМ_ШАБЛОН_ДОК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ШАБЛОН_ДОК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоВходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий" 

	Дано Я открываю основную форму списка документа "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"

	Дано Я открываю основную форму документа "ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТСМ_ХранимыеДанныеОТИЗдляНарядЗаданий"
	И Я закрываю текущее окно

